{
  "overview": {
    "total": 45,
    "season_1": {
      "season_id": 1,
      "episodes": 10,
      "image": "/posters/season_1.jpg",
      "first_aired": "2015-06-24",
      "last_aired": "2015-09-02"
    },
    "season_2": {
      "season_id": 2,
      "episodes": 12,
      "image": "/posters/season_2.jpg",
      "first_aired": "2016-07-13",
      "last_aired": "2016-09-21"
    },
    "season_3": {
      "season_id": 3,
      "episodes": 10,
      "image": "/posters/season_3.jpg",
      "first_aired": "2017-10-11",
      "last_aired": "2017-12-13"
    },
    "season_4": {
      "season_id": 4,
      "episodes": 13,
      "image": "/posters/season_4.jpg",
      "first_aired": "2019-10-06",
      "last_aired": "2019-12-22"
    }
  },
  "all": [
    {
      "no_all": 1,
      "title": "eps1.0_hellofriend.mov",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2015-06-24",
      "us_milions_viewers": 1.75,
      "plot": "Elliot Alderson, un inepto social, trabaja en la empresa de ciberseguridad Allsafe. Por la noche, piratea redes sociales, información personal y registros bancarios, incluidos los de sus compañeros de trabajo, su terapeuta y un traficante de drogas. Elliot detiene un ataque DDoS contra el mayor cliente de Allsafe, E Corp. Identifica un archivo etiquetado como fsociety00.dat y un archivo de texto que le pide que no destruya el malware que encuentra oculto en el servidor de E Corp. Mr. Robot, el misterioso líder del grupo de hackers fsociety, se pone en contacto con Elliot en el metro. Fsociety invita a Elliot a unirse a ellos para iniciar una revolución digital; planean eliminar todos los registros de deudas que posee E Corp. Él está intrigado y finalmente acepta. Como su primer acto de colaboración con fsociety, Elliot proporciona al FBI un archivo cifrado que implica falsamente a Terry Colby, el propio director de tecnología (CTO) de E Corp como el orquestador del ataque.",
      "preview": "/episodes/1.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/b5129e2f-d5af-4986-b18c-8f4d9b92cbe7"
    },
    {
      "no_all": 2,
      "title": "eps1.1_ones-and-zer0es.mpeg",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2015-07-01",
      "us_milions_viewers": 1.73,
      "plot": "Elliot rechaza una oferta de trabajo de Tyrell Wellick, director técnico interino de E Corp. Elliot, cada vez más paranoico, consume más morfina de lo normal. Darlene lo visita en su casa para llevarlo a fsociety, sorprendiéndolo. Mr. Robot y fsociety quieren que Elliot destruya una instalación de respaldo fuera de línea de E Corp llamada Steel Mountain pirateando una planta de gas adyacente y provocando una explosión. Elliot se echa atrás porque no quiere arriesgar vidas. Shayla es la traficante de drogas y amiga de Elliot. Cuando Elliot se da cuenta de que Fernando Vera, el proveedor de Shayla, abusa de ella, Elliot recopila pruebas contra Fernando y lo entrega a la policía, a pesar de las instrucciones explícitas de Shayla de no hacerlo. Mientras tanto, Cisco, un socio desconocido del grupo de hackers chinos The Dark Army, piratea la computadora personal de Ollie con un CD. Elliot y Mr. Robot hablan sobre la pelea de Elliot con su padre: Elliot le contó a su madre sobre la enfermedad terminal de su padre, a pesar de haberle prometido a su padre que mantendría la enfermedad en secreto. El Sr. Robot empuja a Elliot desde una barandilla hacia la playa llena de rocas como castigo por no guardar el secreto de su padre.",
      "preview": "/episodes/2.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/fca2fdee-4a74-49c7-ae18-855fd391c703"
    },
    {
      "no_all": 3,
      "title": "eps1.2_d3bug.mkv",
      "directed_by": "Jim McKay",
      "written_by": "Sam Esmail",
      "air_date": "2015-07-08",
      "us_milions_viewers": 1.68,
      "plot": "Tyrell está furioso porque Scott Knowles fue elegido como director de tecnología. Para desahogarse, Tyrell le paga a un hombre sin hogar para que le permita golpearlo. Cisco exige que Ollie infecte Allsafe con el mismo CD. Elliot cree que ha terminado con fsociety. Tyrell seduce al secretario de su jefe e instala un software en su teléfono. Intentando ser más normal, Elliot le pide a Shayla que lo acompañe a una fiesta, ella acepta y se involucran románticamente. Durante la fiesta, fsociety filtra los correos electrónicos de E Corp que incriminan a Colby por encubrir una fuga de desechos tóxicos que causó leucemia en el padre de Elliot y la madre de Angela. Tyrell ata a su esposa embarazada y la amordaza con una bola a pedido de ella. Ollie confiesa tanto su infidelidad como las demandas de Cisco a Angela. Temiendo el robo de identidad, ella quiere que infecte Allsafe con el CD. Elliot regresa a una sociedad. El director ejecutivo de Allsafe, Gideon Goddard, sospecha de la historia de Elliot sobre el ataque a E Corp y comienza a investigar.",
      "preview": "/episodes/3.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/16d9395e-03e7-4da8-a909-93b4672a2b22"
    },
    {
      "no_all": 4,
      "title": "eps1.3_da3m0ns.mp4",
      "directed_by": "Nisha Gantra",
      "written_by": "Adam Penn",
      "air_date": "2015-07-15",
      "us_milions_viewers": 1.27,
      "plot": "Elliot tiene un nuevo plan para destruir las copias de seguridad en cinta de E Corp de sus datos en Steel Mountain, que implica piratear su sistema de control climático conectando una Raspberry Pi para aumentar lentamente la temperatura (evitando el sistema de control climático) hasta un punto en el que destruirá las copias de seguridad en cinta magnética, pero esto requiere acceso físico al centro de datos fuertemente fortificado. Elliot, Romero, Mobley y Mr. Robot van a Steel Mountain. Con su suministro de morfina cortado, Elliot comienza a tener graves síntomas de abstinencia que incluyen múltiples alucinaciones. Darlene y Trenton se quedan para contactar a Cisco (el ex novio de Darlene) y organizar un ataque de hackers simultáneo por parte del Ejército Oscuro en los sitios de respaldo de E Corp en China. Mientras tanto, Angela y Shayla consumen éxtasis, lo que resulta en que las dos se besen. A la mañana siguiente, Angela sabotea Allsafe usando la identificación de trabajo y la computadora de Ollie.",
      "preview": "/episodes/4.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c0311722-d709-441b-8e22-baf60c7d3766"
    },
    {
      "no_all": 5,
      "title": "eps1.4_3xpl0its.wmv",
      "directed_by": "Jim McKay",
      "written_by": "David Iserson",
      "air_date": "2015-07-22",
      "us_milions_viewers": 1.38,
      "plot": "Con la ayuda de fsociety, Elliot se infiltra en Steel Mountain mediante el uso de lo que él llama 'hazañas humanas'. Casualmente se encuentra con Tyrell y usa su ego para acceder al área restringida donde necesita conectar su Raspberry Pi cargada con el programa para anular el sistema de control climático y destruir las copias de seguridad en cinta de E Corp. Tyrell revela que sabe que Elliot incriminó al CTO, pero no lo delatará. El Ejército Oscuro se niega a atacar la instalación de respaldo en China, lo que pone en peligro el plan de fsociety. Mientras tanto, Tyrell y Joanna cenan con el candidato a CTO Scott y su esposa Sharon en un intento de encontrar sus debilidades. Tyrell se acerca sexualmente a Sharon en el baño. Angela deja a Ollie después de decirle que infectó Allsafe con el CD del hacker y se muda con su padre. Ella descubre que está profundamente endeudado por las viejas facturas médicas de su madre. Elliot encuentra el teléfono de Shayla en el suelo. Fernando Vera lo llama desde la cárcel para que se entere de ello y le insinúa que ha organizado el secuestro de Shayla. Culpa a Elliot de haberlo entregado a la policía.",
      "preview": "/episodes/5.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/39825f54-87ec-4a4d-807b-217c807a8d3f"
    },
    {
      "no_all": 6,
      "title": "eps1.5_br4ve-trave1er.asf",
      "directed_by": "Deborah Chow",
      "written_by": "Kyle Backstreet",
      "air_date": "2015-07-29",
      "us_milions_viewers": 1.25,
      "plot": "Shayla es secuestrada por el hermano de Vera para presionar a Elliot para que hackee a Vera y la saque de la prisión antes de que lo maten en el interior. Elliot visita a Vera para comprobar el sistema cibernético de la prisión y más tarde se da cuenta de que el hermano de Vera organizó el ataque interno. El director técnico interino Scott le revela a Tyrell que su esposa le contó sobre el incidente del baño, lo que lo humilló. Después de que Tyrell destroza su cocina con rabia, Joanna explica que el deseo de Sharon de ser deseada es su vulnerabilidad. Angela se reúne con abogados en un intento de reabrir su demanda por residuos tóxicos contra E Corp; le dicen que es imposible ganar sin el testimonio de alguien de adentro. Elliot saca a Vera de la cárcel y Vera mata inmediatamente a su hermano. Cuando Elliot pregunta por Shayla, Vera le arroja las llaves del auto y dice: 'Ella estuvo contigo todo el tiempo'. Elliot abre el maletero y encuentra a Shayla adentro con la garganta cortada.",
      "preview": "/episodes/6.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/3561d63d-c066-4fd0-8d8c-b1098d4857dd"
    },
    {
      "no_all": 7,
      "title": "eps1.6_v1ew-s0urce.flv",
      "directed_by": "Sam Esmail",
      "written_by": "Kate Ericson",
      "air_date": "2015-08-05",
      "us_milions_viewers": 1.15,
      "plot": "Flashback: Shayla se muda a la casa de al lado y le da a Elliot un pez mascota. Quiere ser su amiga a pesar de su torpeza con la gente. Se ofrece a contactar a un proveedor de suboxone para Elliot. En el presente, ha pasado un mes desde el asesinato de Shayla. Angela hace un trato: mentirá y dirá que rompió la cadena de custodia con el archivo .dat que incriminó a Terry Colby, si a cambio, Colby testifica que E Corp encubrió la fuga de residuos tóxicos en 1993. Gideon advierte a Angela que su plan dejará a Allsafe fuera del negocio. Mientras tanto, Darlene y Mr. Robot intentan volver a unir a fsociety. Ella organiza una reunión en persona con la misteriosa Whiterose, líder del Ejército Oscuro. Tyrell, en una fiesta que celebra el ascenso de Knowles, atrae a Sharon a una azotea aislada y la estrangula mientras la seduce. Elliot le confiesa a su terapeuta que hackea a todo el mundo en un intento de encontrar una forma de salir de la soledad.",
      "preview": "/episodes/7.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/1c2d081c-6d5f-464b-876b-29aa90d4612e"
    },
    {
      "no_all": 8,
      "title": "eps1.7_wh1ter0se.m4v",
      "directed_by": "Christoph Schrewe",
      "written_by": "Randolph Leon",
      "air_date": "2015-08-12",
      "us_milions_viewers": 1.24,
      "plot": "Darlene roba un arma y tiene una conversación con Angela que implica que son amigos desde hace mucho tiempo. Elliot y fsociety vuelven a planificar su ataque, pero aún necesitan al Ejército Oscuro. Elliot conoce a Whiterose, una mujer transgénero obsesionada con el tiempo, que dice que el Ejército Oscuro se echó atrás porque Gideon, sospechoso de la historia de Elliot, convirtió el servidor pirateado de E Corp en un honeypot. Con la ayuda de Darlene, Elliot cierra esto. Tyrell encuentra el archivo .dat de fsociety después de que Gideon le habla del honeypot y se reúne con Mr. Robot, y parece que los dos están trabajando juntos. Le recuerda a Mr. Robot que conoce su 'pequeño secreto sucio' cuando Mr. Robot se niega a cooperar, a lo que Mr. Robot se encoge de hombros. Cuando la policía interroga a los Wellicks sobre el asesinato de Sharon, Joanna rompe en secreto su propia fuente con un tenedor para distraerlos. Elliot le cuenta a Darlene sobre el éxito de su plan, y una extasiada Darlene le dice que lo ama. Él besa a Darlene, quien se indigna. Ella le pregunta si 'se había olvidado otra vez'. Elliot se da cuenta de que Darlene es su hermana, pero no tiene ningún recuerdo de ella. Encuentra un CD que contiene viejas fotos familiares, lo que revela que Mr. Robot es su padre.",
      "preview": "/episodes/8.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/4458d529-5123-453e-a603-c21dc6f758d3"
    },
    {
      "no_all": 9,
      "title": "eps1.8_m1rr0r1ng.qt",
      "directed_by": "Tricia Block",
      "written_by": "Sam Esmail",
      "air_date": "2015-08-19",
      "us_milions_viewers": 1.32,
      "plot": "Un flashback muestra a un joven Elliot y a su padre en su taller de reparación de ordenadores, 'Mr. Robot'. Después del nacimiento de su hijo, Joanna le dice a Tyrell que necesita mantener el control si 'quiere ser parte de esta familia'. Tyrell es despedido de E Corp - su último acto es evitar que Gideon revierta el honeypot. Mr. Robot hace un viaje con Elliot a la casa de su infancia. Enfadado, Elliot empuja a Mr. Robot por una ventana y luego lo lleva a un cementerio. Mr. Robot le dice a Elliot que no deje que Angela y Darlene 'se deshagan de él', y que siempre lo amará. Cuando llegan, Elliot, solo en la tumba de su padre, se da cuenta de que había asumido la personalidad de su padre muerto todo el tiempo, diciendo 'Soy Mr. Robot'. Terry Colby le ofrece a Angela un trabajo en E Corp. Elliot ahora duda de la continuación de su plan Mr. Robot/fsociety. Tyrell amenaza a Elliot sobre el plan de fsociety - Elliot lleva a Tyrell a la sala de juegos y entiende que continuará con el hack. Acuerdan trabajar juntos, pero Elliot mira la máquina de palomitas de maíz donde está escondida la pistola de Darlene.",
      "preview": "/episodes/9.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2e309bf1-2d57-43fc-8fe4-be6cd24d2b6a"
    },
    {
      "no_all": 10,
      "title": "eps1.9_zer0-day.avi",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2015-09-02",
      "us_milions_viewers": 1.21,
      "plot": "El psiquiatra de Elliot se encuentra con su ex novio, a quien Elliot hackeó y obligó a romper con ella. Intenta persuadirla para que ayude a la policía a arrestar a Elliot, pero ella se niega. Elliot se despierta solo en la camioneta de Tyrell tres días después de la conclusión del episodio anterior, sin recordar esos dos días. El hackeo de fsociety tuvo éxito, arrojando al mundo al caos y reuniendo multitudes que vitoreaban en toda la ciudad. fsociety encripta sus datos y cubre sus huellas. E Corp está preparando una entrevista televisiva de emergencia. El vicepresidente ejecutivo de tecnología de E Corp se suicida en la televisión después de afirmar que la situación es desesperada. Elliot habla con Mr. Robot nuevamente y le pregunta sobre la ubicación de Tyrell. Visita la dirección de Tyrell, pero solo encuentra a Joanna, presentándose como 'Ollie'. El episodio termina con Elliot abriendo la puerta de su apartamento; no se ve al visitante. En una escena post créditos, se muestra a Whiterose, vestida de hombre, y a Phillip Price, el director ejecutivo de E Corp, conversando en un evento formal donde Price indica que 'sabe quién es el responsable'.",
      "preview": "/episodes/10.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/3e58542a-35e3-4c0d-b678-50aa06fa06d5"
    },
    {
      "no_all": 11,
      "title": "eps2.0_unm4sk-pt1.tc",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-13",
      "us_milions_viewers": 1.04,
      "plot": "Un breve flashback muestra que Tyrell grabó un video de fsociety la noche que visitó a Elliot. Un mes después, Elliot se ha desconectado, vive con su madre y mantiene una rutina repetitiva en un intento de debilitar la influencia de Mr. Robot, quien se le aparece continuamente y lo atormenta mientras se niega a decirle lo que le sucedió a Tyrell. fsociety continúa bajo el liderazgo de Darlene, pirateando la casa inteligente de la asesora general de E Corp, Susan Jacobs, y usándola como base de operaciones después de obligar a Jacobs a mudarse. Gideon visita a Elliot, le dice que Allsafe ya no existe y que el FBI cree que él está detrás del hackeo o al menos es cómplice de alguna manera. Con la ayuda de Mobley, Darlene ejecuta un hackeo en el Banco de E Corp, reteniendo sus registros para pedir un rescate.",
      "preview": "/episodes/11.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2ce93a3e-9dab-427f-8241-2dd9fc66d966"
    },
    {
      "no_all": 12,
      "title": "eps2.0_unm4sk-pt2.tc",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-13",
      "us_milions_viewers": 1.04,
      "plot": "Como parte de la demanda de rescate, fsociety obliga a Scott Knowles a usar una máscara de fsociety y quemar públicamente los $ 5.9 millones del hackeo del episodio anterior. Angela continúa subiendo la escalera en E Corp, aparentemente contenta con su nuevo puesto corporativo, y parece abandonar la demanda. Joanna recibe un regalo en su puerta, una caja de música con un teléfono escondido debajo, pero pierde la llamada. Elliot descubre que ha estado actuando bajo la influencia de Mr. Robot mientras pensaba que estaba durmiendo. Un hombre llamado Brock asesina a Gideon, quien anteriormente había amenazado con informar el comportamiento sospechoso de Elliot en Allsafe al FBI y al agente Dominique DiPierro. Elliot se despierta de un estado disociativo en el teléfono, recibido en el otro extremo por Tyrell.",
      "preview": "/episodes/11.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2ce93a3e-9dab-427f-8241-2dd9fc66d966"
    },
    {
      "no_all": 13,
      "title": "eps2.1_k3rnel-pan1c.ksd",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-20",
      "us_milions_viewers": 0.79,
      "plot": "Un flashback revela que Romero quería alquilar la sala de juegos a Mobley, pero Mobley lo reclutó para fsociety. Después de una conversación confusa con Tyrell por teléfono, Elliot intenta deshacerse por completo de Mr. Robot. Las noticias informan de la muerte de Gideon, lo que sorprende a Elliot. Más tarde, Mobley encuentra a Romero muerto en casa. Mobley y Trenton temen que el Ejército Oscuro los esté persiguiendo y sospechan de Darlene y Elliot. Dominique DiPierro toma instantáneas de una lista encontrada en la mesa de la computadora en la escena del crimen que denota agentes del FBI y su información. Ray está a la caza de un ingeniero cibernético para sus propios propósitos siniestros y logra convencer a Elliot de que se abra sobre Mr. Robot. Elliot una vez más tiene problemas con el abuso de drogas y toma una cantidad obscena de Adderall, lo que lleva a un colapso mental. Phillip Price invita a Angela a cenar e intenta hacer que se tome las cosas de manera menos personal. Dominique decide continuar con la investigación de Romero después de encontrar su nombre en la lista; Mientras visita a la madre de Romero, encuentra un cartel de la 'Fiesta del Fin del Mundo', que la lleva a la sala de juegos de fsociety.",
      "preview": "/episodes/13.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/8ea9de87-2d33-4592-849c-1ee39d3d3827"
    },
    {
      "no_all": 14,
      "title": "eps2.2_init_1.asec",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-27",
      "us_milions_viewers": 0.63,
      "plot": "En Halloween del año anterior, Mr. Robot apareció por primera vez y le sugirió el hack a Darlene mientras Elliot usaba la máscara de fsociety. En el presente, Elliot rechaza su pedido de ayuda. Mr. Robot afirma que si Elliot puede vencerlo en ajedrez, se irá para siempre. Aunque Krista lo desaconseja, Leon le dice que luche por lo que quiere; sin embargo, las tres partidas terminan en tablas. Dominique encuentra un casquillo de bala en la galería. Whiterose presiona a Price para que se mantenga a tiempo y monitorea al FBI. Angela asume que Price quiere que ella ayude a resolver la demanda colectiva por la fuga tóxica después de que ella delate a los otros ejecutivos, pero él rechaza su teoría. Joanna se está quedando sin fondos por pagarle al encargado del estacionamiento que encontró la camioneta de Tyrell durante el hack para que se quede callado. Scott rechaza su oferta de testificar contra Tyrell a cambio de la indemnización por despido de Tyrell. Cisco le dice a Darlene que el Ejército Oscuro no habría matado a Romero, cuyo asesinato podría tener algo que ver con un programa de vigilancia ilegal del FBI llamado Proyecto Berenstain. Elliot acepta ayudar a Ray, pero usa secretamente la computadora para contactar a Darlene y hackear al FBI.",
      "preview": "/episodes/14.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/b9515a8a-e6e8-4a61-a87f-b303954afe77"
    },
    {
      "no_all": 15,
      "title": "eps2.3_logic-b0mb.hc",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2016-08-03",
      "plot": "Elliot escribe el malware del FBI desde la computadora de Ray. Darlene le dice a Angela que pueden borrar los registros del FBI que la conectan con el CD de Allsafe si ayuda, pero ella se niega. El encargado del estacionamiento que encontró la camioneta de Tyrell teme que el FBI esté tras él, por lo que Joanna ordena que lo maten. Elliot le dice a Ray que debe comunicarse con su especialista en TI anterior, 'RT'; Ray acepta de mala gana y trae a RT. Dominique y su equipo viajan a China para investigar la participación del Ejército Oscuro en Five/Nine. Allí, conocen al Ministro Zhang, el Ministro de Seguridad del Estado chino, que en realidad es Whiterose. Después de que Dominique y Zhang tienen una conversación privada por la noche, unos hombres armados atacan la oficina a la mañana siguiente, matando a la mayoría del equipo de Dominique. Joanna recibe una llamada telefónica de alguien que respira con dificultad, posiblemente Tyrell. Después de que su ex novio Ollie la vende al FBI, Angela decide ayudar con el hack. Elliot le pregunta a RT qué le pasó y RT revela que Ray administra un sitio web del mercado negro que trafica con drogas, armas y esclavas sexuales. Esa noche, unos matones irrumpen en la casa de Elliot, lo arrastran a la calle y lo golpean mientras Ray le recuerda que le advirtieron que no mirara.",
      "preview": "/episodes/15.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/7b9c5f29-4ef3-471d-8196-1192d1443c48"
    },
    {
      "no_all": 16,
      "title": "eps2.4_m4ster-s1ave.aes",
      "directed_by": "Sam Esmail",
      "written_by": "Adam Penn",
      "air_date": "2016-08-10",
      "us_milions_viewers": 0.57,
      "plot": "Elliot vive una versión retorcida de una comedia de situación de los años 90 de un viaje familiar por carretera con Tyrell encerrado en el maletero, con ALF. Mr. Robot lo anima a mantener la vista hacia adelante hasta que esté listo para despertar en el hospital. Ray le hace saber que es el amo de Elliot. Al ser encerrado por Lone Star, Elliot abraza a Mr. Robot por proteger su mente durante la paliza. Un flashback revela que, el día que el padre de Elliot le dijo que lo habían despedido por estar enfermo, también dejó que Elliot le pusiera nombre a su nueva tienda de computadoras. Cisco recibe equipo del Dark Army para el hackeo del FBI de fsociety, pero le rompen una aguja hipodérmica en el dedo por hacer demasiadas preguntas. Dominique se salvó del tiroteo, ya que ambos atacantes se suicidaron. Aunque se culpa del ataque a los separatistas chinos, ella está decidida a investigar al Dark Army. El Congreso se niega a seguir adelante con el plan de rescate de Phillip Price para pedir prestado a China porque cuatro agentes del FBI fueron asesinados allí. Darlene y Mobley le enseñan a Angela a hackear el FBI, pero Dominique aparece justo antes de que pueda terminar.",
      "preview": "/episodes/16.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/a0ecc8fd-7608-4d1d-82c1-721027b0fbbf"
    },
    {
      "no_all": 17,
      "title": "eps2.5_h4ndshake.sme",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-08-17",
      "us_milions_viewers": 0.68,
      "plot": "Dominique se entera de la historia de Angela y sospecha cuando el FBI es hackeado. Angela confronta a Darlene sobre ella y Elliot creando fsociety después de recordar que las máscaras se originaron en una película que vieron muchas veces cuando eran niños. Angela resuelve la demanda de E Corp v Washington Township y, a través de Price, es reasignada a la división de Gestión de Riesgos. Pero sobrepasa los límites en su primera reunión de directores. fsociety puede interrumpir la votación de rescate de Price. Mr. Robot le admite a Elliot que dispararon a Tyrell. Elliot arregla el sitio web de Ray, pero también alerta al FBI a través de Internet después de ver que están vendiendo esclavos, drogas y armas pesadas en la Dark Net. Ray se da cuenta de lo que Elliot ha hecho y, sintiendo remordimiento, deja ir a Elliot cuando llega el FBI. Mr. Robot anima a Elliot a ser un líder, haciendo las paces con él para beneficiarlos a ambos. Una pandilla ataca a Elliot por cerrar el sitio web de Ray, pero Leon los detiene; trabaja para el Ejército Oscuro, protegiendo a Elliot para Whiterose. Leon le dice a Elliot que recibirá una carta y que haga lo que dice. Elliot le admite a Krista que sabe que nunca estuvo en casa de su madre, y el espectador finalmente se entera de que está en prisión.",
      "preview": "/episodes/17.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/a36d13b9-a1dd-436d-bc12-ee4f9864096d"
    },
    {
      "no_all": 18,
      "title": "eps2.6_succ3ss0r.p12",
      "directed_by": "Sam Esmail",
      "written_by": "Courtney Looney",
      "air_date": "2016-08-24",
      "us_milions_viewers": 0.74,
      "plot": "FSociety se entera de que el Proyecto Berenstain es una vigilancia ilegal de tres millones de personas para la investigación Five/Nine que ha dado lugar a 16 sospechosos principales, uno de ellos fallecido. Mobley teme que Romero sea el sospechoso muerto, lo que significa que el FBI está cerca de ellos. fsociety divulga esta información, lo que causa problemas para el FBI, pero Susan Jacobs llega a casa y los ve. La atan e intentan hackearla para obtener información de chantaje, pero Darlene recuerda a Susan riéndose cuando E Corp fue absuelta en el caso de la fuga tóxica que mató a su padre. Darlene la electrocuta con una pistola eléctrica, fatalmente debido a la condición cardíaca de Susan, y afirma que fue en defensa propia, un accidente. Darlene y Cisco incineran el cuerpo de Susan mientras Mobley y Trenton entran en pánico. Dominique entrevista al dueño del arma robada de Darlene y lleva a Mobley para interrogarlo sobre la sala de juegos, todavía buscando a Tyrell. Él no le da nada y Dominique se ve obligada a dejarlo ir. Mobley le advierte a Trenton que deben correr, pero llega dos horas tarde a su reunión con Trenton, aunque alguien la encuentra. El amorío de Angela era una infiltración del FBI, pero ella lo abandonó por un hombre mayor. Darlene ve que Cisco está informando sobre ella al Ejército Oscuro y lo ataca con un bate de béisbol.",
      "preview": "/episodes/18.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/04004fbd-ddad-416f-87a3-55a980f8a089"
    },
    {
      "no_all": 19,
      "title": "eps2.7_init_5.fve",
      "directed_by": "Sam Esmail",
      "written_by": ["Kyle Bradstreet", "Lucy Teitler"],
      "air_date": "2016-08-31",
      "us_milions_viewers": 0.65,
      "plot": "El golpe a la puerta de Elliot era la policía para arrestarlo por hackear a Lenny, el ex de Krista, y robarle su perro. Se declara culpable; está en la cárcel al día siguiente con Ray como director, estableciendo su ilusión. A pesar de que su sentencia es de 18 meses, es liberado 86 días después debido a las medidas de control de costos. Darlene le informa que Mobley y Trenton están desaparecidos. A través de Cisco, hackean el teléfono de un agente del Ejército Oscuro para monitorear conversaciones que se refieren a una 'Etapa 2'. Angela hackea E Corp ella misma, descubriendo que la fuga de desechos tóxicos en la planta de Washington Township no se arregló, aunque se vuelve demasiado sospechosa para ser una denunciante; Dominique le dice que se está quedando sin opciones. Darlene dejó una cinta de fsociety con su cara en la casa de Susan; Cisco la recupera y escucha a alguien. Whiterose había organizado la muerte del anterior director ejecutivo de E Corp por interferir con la planta. Price logra calmar a Zhang (Whiterose) diciéndole que puede quedarse con la planta si China le presta a E Corp algo de dinero de rescate como muestra de buena voluntad. Elliot y Mr. Robot se dan cuenta de que, de alguna manera, se están desconectando el uno del otro. Darlene escucha al Ejército Oscuro decir que la Etapa 2 es el plan de Elliot mientras alguien llama a su puerta. Joanna espera a Elliot afuera de su apartamento.",
      "preview": "/episodes/19.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/e41826d9-4c69-434e-be57-521fbef98475"
    },
    {
      "no_all": 20,
      "title": "eps2.8_h1dden-pr0cess.axx",
      "directed_by": "Sam Esmail",
      "written_by": ["Kor Adana", "Randolph Leon"],
      "air_date": "2016-09-07",
      "us_milions_viewers": 0.76,
      "plot": "Price hace que Colby mueva hilos políticos para permitir que China se anexione el Congo a cambio de un rescate financiero de E Corp. Cisco encuentra a uno de los miembros de fsociety gravemente herido y convence a Darlene de que necesita un hospital. Un testigo identifica a Cisco saliendo de la casa de Susan y las autoridades comienzan a investigar si sus vacaciones son realmente una desaparición. A pesar de las protestas de Dominique de que el Ejército Oscuro atacará, la imagen de Cisco se divulga a los medios como sospechoso de Five/Nine. El personal de urgencias del hospital ve más tarde la orden de búsqueda y captura, y reporta su ubicación. Joanna convence a Elliot de rastrear el teléfono que cree que dejó Tyrell. Elliot rastrea la llamada hasta una residencia cercana, pero el Sr. Sutherland cree que no será Tyrell según la ubicación. Elliot y Angela se encuentran más tarde en el metro para hablar. Ella le hace darse cuenta de que hay más lagunas en su memoria y le advierte que no confíe en Mr. Robot. Derrotada, Angela tiene la intención de confesar con su abogado, admitiendo su participación en el hackeo del FBI. Después de besarse con Elliot, se le acercan dos figuras. Dominique sigue a Darlene y Cisco hasta un restaurante, pero mientras está dentro, un tirador del Ejército Oscuro les dispara y ella sale del restaurante cubierta de sangre.",
      "preview": "/episodes/20.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/d1571aed-df0e-460c-a242-e50750d48efc"
    },
    {
      "no_all": 21,
      "title": "eps2.9_pyth0n-pt1.p7z",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-09-14",
      "us_milions_viewers": 0.68,
      "plot": "Dominique exige que se investigue el tiroteo como un posible acto de guerra por parte del Ejército Oscuro, pero le dicen que el gobierno no molestará a China después de que acaban de darle a los EE. UU. un préstamo de 2 billones de dólares. Joanna considera que la ubicación del teléfono es un gran regalo de Tyrell. Phillip Price usa el dinero del rescate para fortalecer Ecoin, obligando al gobierno a apoyarlo para seguir el ritmo de China y reconstruir el sector bancario. Angela es llevada a una casa donde una joven aparentemente torturada le hace una evaluación psicológica. Su captora es Whiterose, quien dice que Angela debería haber muerto hace meses; quiere que Angela crea en la causa de Whiterose y afirma que la madre de Angela y el padre de Elliot murieron por un bien mayor. Al regresar a la ciudad esa noche, Angela le dice a su abogado que nunca la vuelva a llamar. Elliot usa una técnica de sueño lúcido para ver a Mr. Robot decodificar un mensaje en el apartamento. Mientras lo sigue, Elliot toma el control de camino a un taxi que la espera. Para su sorpresa, Tyrell logra subir. A pesar de aceptar su destino, el taxista no reconoce directamente la existencia de Tyrell y echa a Elliot por entrar en pánico. Tyrell dice que el Ejército Oscuro tiene lista la Etapa 2 y que Elliot estará contento.",
      "preview": "/episodes/21.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/4fa76068-145f-4e97-ac17-00eb47b16b6d"
    },
    {
      "no_all": 22,
      "title": "eps2.9_pyth0n-pt2.p7z",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-09-21",
      "us_milions_viewers": 0.85,
      "plot": "Meses antes, Tyrell le rogó a Elliot que lo dejara participar del plan. En la actualidad, lleva a Elliot a un lugar discreto, al otro lado de la calle de donde se revela que E Corp está reuniendo todos sus registros en papel. Elliot se da cuenta de que la Etapa 2 implica diseñar una explosión en la instalación de respaldo para destruir permanentemente los datos de E Corp. Scott Knowles es el dueño del teléfono misterioso, engañando a Joanna para hacerla sufrir porque quería que ella sintiera lo que él sentía. Scott golpea a Joanna después de que ella calumnia a su esposa fallecida. Joanna convence a Derek para que incrimine a Scott por el asesinato de Sharon como venganza. Después del ataque del Ejército Oscuro, Darlene es interrogada por el FBI. Dominique le muestra que juega un papel importante en la investigación del FBI. Convencido de que Tyrell no es real, Elliot intenta deshacer el hack del firmware, pero Tyrell le dispara con el arma robada de Darlene. Angela recibe una llamada de un Tyrell angustiado a través del Ejército Oscuro, y se va para estar con Elliot cuando se despierta. En una escena post créditos, se revela que Mobley y Trenton se esconden en la Costa Oeste. Trenton le revela a Mobley que ha encontrado una forma de deshacer el ataque. Mientras Mobley expresa su deseo de dejar atrás el incidente, Leon se acerca a los dos y les pide que le den la hora.",
      "preview": "/episodes/22.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/f699b498-ad88-413f-b30c-560a7d769d8e"
    },
    {
      "no_all": 23,
      "title": "eps3.0_power-saver-mode.h",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-10-11",
      "us_milions_viewers": 0.68,
      "plot": "Zhang tiene la intención de que Elliot muera una vez que haya completado su trabajo para el Ejército Oscuro. En pánico por la muerte de Elliot, Tyrell llama al vendedor de autos usados ​​y agente del Ejército Oscuro Irving. Elliot se despierta una semana después en una habitación con Angela. Encuentra que el edificio de piratería de firmware está vacío. Darlene aparece y le sonsaca información, pero él miente y dice que Tyrell nunca estuvo involucrado. Con la energía aún cortada, ella lo lleva a un torneo de hackers clandestino con conexiones de fibra. Cierra la puerta trasera a E Corp, pero los agentes del Ejército Oscuro los obligan a irse. Irving sacude su cola del FBI y Elliot piensa que ha cancelado la Etapa 2. Pensando que su revolución empeoró las cosas, le pide a Angela un trabajo en E Corp para arreglar las cosas. Esa noche, Mr. Robot emerge y Angela lo lleva a trabajar con Irving y Tyrell, creando otra forma de avanzar en la Etapa 2. Angela planea manipular a Elliot junto con Mr. Robot, creyendo en el plan de Whiterose de deshacer todo lo que E Corp ha hecho y crear un mundo nuevo.",
      "preview": "/episodes/23.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/9cb3bf1d-228c-49d7-af09-834141018a44"
    },
    {
      "no_all": 24,
      "title": "eps3.1_undo.gz",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-10-18",
      "us_milions_viewers": 0.51,
      "plot": "Cinco semanas después, Elliot se abre camino dentro de E Corp, denunciando a los ejecutivos de menor rango y convenciendo a un gerente de nivel medio para que comience a digitalizar los registros en papel mientras traslada en secreto el resto del edificio de la Etapa 2 a un almacén de E Corp. Scott Knowles es arrestado por el asesinato de Sharon. Joanna aparece en televisión diciendo que siempre amará a Tyrell; Derek la mata y el Sr. Sutherland mata a Derek. Una fuente desconocida publica otro video de fsociety. Dominique y el FBI presionan a Darlene y revelan la llamada telefónica que Elliot le hizo a Tyrell desde la prisión. Darlene se queda a dormir en casa de Elliot, pero Mr. Robot aparece y la asusta. Phillip Price tiene a todas las naciones necesarias, excepto China, a bordo de Ecoin. Cuando Price intenta amenazar a Zhang con la votación de la ONU para permitir que China se anexione el Congo, Zhang revela su control sobre Angela. Zhang quiere que la Etapa 2 comience el día de la votación, ya sea que ganen o pierdan, para castigar a Price. Elliot deja salir a Mr. Robot durante una sesión de terapia donde le dice a Krista que él y Elliot estaban comprometidos. Lenny devuelve al perro enfermo. Elliot se da cuenta de que Darlene pinchó su ordenador y va a la casa segura del FBI de Darlene.",
      "preview": "/episodes/24.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/955d6b7a-e2a6-443e-8bda-07e94986778f"
    },
    {
      "no_all": 25,
      "title": "eps3.2_legacy.so",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-10-25",
      "us_milions_viewers": 0.54,
      "plot": "La noche del hack, Mr. Robot intenta dispararle a Tyrell, pero el arma se atasca. Tyrell convence a Mr. Robot de que lo necesita para la Etapa 2. Irving y el Ejército Oscuro aparecen, afirmando que Gideon le dijo al FBI que Tyrell cerró el honeypot, lo que lo convirtió en el principal sospechoso del hack. Llevan a Tyrell a una cabaña en un área aislada. La evaluación psicológica lo destroza, pero admite que siempre será leal a Elliot. Zhang comienza a trabajar tanto en Tyrell como en Elliot. Tyrell obtiene acceso seguro para diseñar la Etapa 2 con el firmware de Cisco. Los informes de que Joanna se está mudando hacen que Tyrell se enoje y salga a caminar, tras lo cual es arrestado por un oficial de policía local. El oficial es asesinado por el agente del FBI Santiago, otro agente del Ejército Oscuro y superior de Dominique, lo que garantiza que nadie sepa sobre Tyrell. Irving puede calmar a Tyrell, diciendo que puede recuperar a su familia cuando esto termine. Irving verifica a Elliot a través de Leon. Tyrell es llevado a un hotel controlado por el Ejército Oscuro y está emocionado de volver a encontrarse con Elliot. Después de tener que tranquilizarlo, Angela le explica a Tyrell la existencia de Mr. Robot. Después de la cirugía, Mr. Robot despierta y le sonríe a Tyrell por seguir el plan.",
      "preview": "/episodes/25.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/f3660ac0-52a0-42b8-8629-68e87fedd695"
    },
    {
      "no_all": 26,
      "title": "eps3.3_metadata.par2",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2017-11-01",
      "us_milions_viewers": 0.55,
      "plot": "Darlene es capaz de jugar con las sospechas de Elliot sobre ella al unirse por su desconfianza compartida hacia Mr. Robot. Elliot admite que la Etapa 2 nunca fue cancelada, sospechando que Mr. Robot emerge por la noche y le pide a Darlene que se esconda en el apartamento vacío de Shayla para seguirlo. Darlene se enfurece cuando ve a Mr. Robot irse con Angela. Tyrell ha perdido toda la fe en Elliot después de enterarse de los retrasos en el envío de los registros. Con tres días antes de que ocurra la Etapa 2, Angela dice que pueden mover todos los registros en papel durante el fin de semana. Ella tranquiliza a Elliot cuando emerge y los ve a Tyrell y a ella. Angela hace que Phillip Price despida a Elliot para evitar que interfiera. Tyrell quiere que él y su familia sean enviados a un lugar seguro en Ucrania después de la Etapa 2. Dominique captura la fuente del nuevo video de fsociety, todavía convencida de que realmente es Dark Army. Darlene promete seguir una pista, pero sin un cable y después de haberle hecho prometer a Elliot que se vengará si algo le sucede.",
      "preview": "/episodes/26.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/a00aba78-f6d2-4ed1-b54f-d87e0950d20d"
    },
    {
      "no_all": 27,
      "title": "eps3.4_runtime-error.r00",
      "directed_by": "Sam Esmail",
      "written_by": ["Kor Adana", "Randolph Leon"],
      "air_date": "2017-11-08",
      "us_milions_viewers": 0.52,
      "plot": "Sin ningún recuerdo de los últimos cuatro días, Elliot va a trabajar el día de la votación de la ONU. Se da cuenta de que lo han despedido y que la Etapa 2 se llevará a cabo hoy. Intenta evadir la seguridad para cerrarla, pero lo atrapan y lo escoltan hasta la salida. Intenta llamar con una amenaza de bomba para que evacuen el edificio objetivo, mientras una gran multitud de manifestantes anti E Corp se reúne en la sede. Darlene aparece, admitiendo que está trabajando con el FBI y que Angela está trabajando con Mr. Robot, ayudando a Elliot a recordar sus días perdidos. Los manifestantes irrumpen en E Corp, aterrorizando a los trabajadores. Irving llama a Angela, diciendo que el motín es una distracción para que puedan enviar a Elliot a copiar datos importantes de un HSM en una habitación segura como requisito previo a la Etapa 2. Angela se entera de que la ONU aceptó la anexión, luego se acerca un guardia de seguridad sospechoso. Ella atrae a los manifestantes, que atacan al guardia de seguridad, para poder completar la tarea destinada a Elliot, luego pasa los datos a un agente del Ejército Oscuro. Elliot la confronta en medio del caos y le pregunta si hay algo que ella necesite decirle.",
      "preview": "/episodes/27.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/b3f0b41c-a97f-4f58-89ea-76384f667452"
    },
    {
      "no_all": 28,
      "title": "eps3.5_kill-process.inc",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2017-11-15",
      "us_milions_viewers": 0.59,
      "plot": "Angela no le dice nada a Elliot, pero él se da cuenta de que Tyrell está en el restaurante Red Wheelbarrow; Darlene le transmite esta información a Dominique. Aunque el agente Santiago les impide hacerlo, Dominique y su compañero lo comprueban ellos mismos. Irving le da a Tyrell instrucciones escritas que lo molestan. Dominique encuentra el escondite de Tyrell en el restaurante, pero no lo alcanza. Mientras tanto, Elliot va al edificio objetivo de la Etapa 2 para evitar la explosión desde adentro, a pesar de que Mr. Robot lo retrasa constantemente y hace que Elliot se ataque a sí mismo. Darlene se enfrenta a Angela, amenazando con denunciarla al FBI, pero Angela insiste en que nadie saldrá herido. Elliot convence a Mr. Robot para que ayude cuando se dan cuenta de que los registros en papel no están en el edificio. Dominique ve a Tyrell arrestado en público, gritando para que detengan el ataque. Creyendo que ha detenido la Etapa 2, Elliot está reflexionando sobre el verdadero plan de Whiterose cuando ve informes de explosiones en las instalaciones de 71 E Corp a las que redirigió los registros en papel, dejando miles de muertos. Elliot se da cuenta de que él es responsable del aumento de la magnitud de la Etapa 2.",
      "preview": "/episodes/28.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c677f666-4e36-4038-b7b8-99649dc0bc3d"
    },
    {
      "no_all": 29,
      "title": "eps3.6_fredrick+tanya.chk",
      "directed_by": "Sam Esmail",
      "written_by": "Adam Penn",
      "air_date": "2017-11-22",
      "us_milions_viewers": 0.54,
      "plot": "Elliot corre hacia Krista y Mr. Robot le hace darse cuenta de que Elliot puede estar involucrado. Darlene está inquieta por la ilusión de Angela de que los muertos seguirán estando bien y volverán. Irving hace que Mr. Robot se dé cuenta de que toda su revolución solo ocurrió porque la élite lo permitió. Zhang planea trasladar la planta de Washington Township al Congo; Zhang arruinó a Price como castigo por su desobediencia y por no controlar a Angela y la demanda y ahora tiene la intención de seleccionar a su reemplazo. Leon mata al amigo de Mobley y hace que Mobley y Trenton ayuden a enterrar el cuerpo en el desierto. Al regresar a casa, se encuentran con el asistente de Zhang y agentes del Ejército Oscuro. Tyrell hace el papel de cautivo, a pesar de la incredulidad de Dominique. Tyrell identifica a los líderes de fsociety que están planeando otro ataque dentro de las 24 horas como los dos sospechosos que se revelan al público. El agente Santiago revela la muerte de Joanna y amenaza al hijo de Tyrell si Tyrell se sale del plan. El Ejército Oscuro muestra a Mobley y Trenton un código para un ataque al control del tráfico aéreo y los obliga a dispararse en la cabeza. Dominique observa cómo la redada encuentra los dos cuerpos que vinculan a fsociety con Irán. Dominique, atónita, cree que el verdadero cerebro, Whiterose, realmente se saldrá con la suya.",
      "preview": "/episodes/29.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c2ad54b8-485b-4d2c-aa52-9ff3590c826f"
    },
    {
      "no_all": 30,
      "no_season": 8,
      "title": "eps3.7_dont-delete-me.ko",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-11-29",
      "us_milions_viewers": 0.44,
      "plot": "Elliot le dice a Darlene que nada, desde las drogas hasta la terapia o el hecho de ingresar voluntariamente en la cárcel, mantiene a raya a Mr. Robot, diciendo que el mundo que se desmorona a su alrededor es culpa suya. Pone sus asuntos en orden dándole su perro a su vecino, tirando su chaqueta de Mr. Robot a la basura y yendo a las familias de Trenton y Mobley para presentar sus respetos. Elliot compra una cantidad letal de pastillas de morfina y se dirige a Coney Island para suicidarse, pero Mohammad, el hermano menor de Trenton, lo disuade, a quien Elliot se ve obligado a cuidar cuando sus padres lo dejan solo. Después de que Mohammad deja una película a la que Elliot lo lleva y va a una mezquita, Elliot lo confronta, quien admite que desearía estar muerto. Después de dejar a Mohammad en su casa, va al apartamento de Angela y le recuerda un 'juego de los deseos' que solían jugar cuando eran niños, lo que le da a Elliot la voluntad de vivir. Después de llegar a casa, recuperar la chaqueta y reinstalar su computadora, nota un mensaje enviado por Trenton antes de su muerte diciendo que hay una manera de deshacer el hack.",
      "preview": "/episodes/30.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/908cb19b-9cfa-4339-bd3f-3a842c7ab653"
    },
    {
      "no_all": 31,
      "title": "eps3.8_stage3.torrent",
      "directed_by": "Sam Esmail",
      "written_by": ["Kyle Bradstreet", "Courtney Looney"],
      "air_date": "2017-12-06",
      "us_milions_viewers": 0.43,
      "plot": "Mr. Robot va a la casa de Tyrell, donde ambos conocen a Price, quien anuncia que Tyrell será una figura decorativa como el nuevo CTO. Tyrell se da cuenta de que sigue siendo el títere del Ejército Oscuro, pero tienen una debilidad en el FBI. Elliot reaparece, leyendo el mensaje de Mr. Robot sobre la conexión. El correo electrónico de Trenton revela que Romero guardó las claves de cifrado de Five/Nine que podrían revertir todo y ahora están dentro del FBI. Darlene seduce a Dominique, pero la atrapan tratando de obtener su placa. Angela sigue engañada, creyendo en el plan de Whiterose para deshacer todo y ya no confía en Elliot; los hombres recogen a Angela. Darlene le dice la verdad al FBI, y también afirma que sabe que el Ejército Oscuro los posee. Santiago entra en pánico y llama a Irving. A través de Irving y Leon, Elliot se reúne con el asistente de Zhang para una Etapa 3 falsa; su escaneo de su computadora portátil le da acceso al Ejército Oscuro. Whiterose está indignada porque trasladar la planta al Congo llevará un mes. Ella da permiso para que Elliot muera.",
      "preview": "/episodes/31.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/f737bedc-08ba-4b2a-9d6d-be3cba1ac6b7"
    },
    {
      "no_all": 32,
      "title": "shutdown -r",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-12-13",
      "us_milions_viewers": 0.45,
      "plot": "Dominique y Darlene, secuestrados por Santiago después de descubrir su condición de agente doble, y Elliot son llevados a un granero abandonado. Santiago y Dominique salen a Irving, donde Santiago es asesinado y Dominique se ve obligado a ser el nuevo topo del FBI. En el interior, el asistente de Whiterose, Grant, se prepara para matar a Elliot y Darlene. Elliot idea un plan para trasladar la planta de Whiterose al Congo antes, lo que Elliot puede intentar. Grant se suicida cuando Whiterose dice que ya no es de ninguna utilidad. Elliot consigue trasladar la planta y la terrible experiencia llega a su fin con todos a salvo. Darlene intenta disculparse con Dominique, pero ella se niega a disculparse por odio. Dominique le da a Elliot acceso al FBI, donde se entera de que Romero no era responsable de las claves de cifrado; en cambio, Mr. Robot los salvó, ya que es lo que Elliot querría. Los dos hacen las paces y prometen acabar con los verdaderos villanos del mundo mientras Elliot revierte el Five/Nine. Mientras tanto, Angela es llevada a la casa de Phillip Price, donde él le revela que él es su verdadero padre y la convence de la naturaleza malvada de Whiterose. En una escena post créditos, Darlene es confrontada por Vera frente al departamento de Elliot.",
      "preview": "/episodes/32.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/0af2f3c7-b53d-4498-a90a-e06527d5a0f2"
    },
    {
      "no_all": 33,
      "title": "401 Unauthorized",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-10-06",
      "us_milions_viewers": 0.44,
      "plot": "La temporada retoma la anterior con la conversación de Angela con Price. Angela exige venganza contra Whiterose, pero Price intenta y no logra disuadirla. Mientras él se aleja, los agentes del Ejército Oscuro aparecen y matan a Angela. Whiterose le da a Elliot hasta fines de diciembre para vivir, enviándole una foto del cuerpo de Angela como advertencia. A mediados de diciembre, Tyrell se ha vuelto hosco y aburrido como el títere del CTO. Dominique se ha mudado con su madre y se vuelve muy paranoica; la nueva amiga de su madre, Janice, es su nueva manejadora del Ejército Oscuro, advirtiéndole que regrese al trabajo para limpiar el desastre de Santiago. Elliot y Mr. Robot trabajan juntos para chantajear a un abogado, Freddy, y pueden obtener información de que Whiterose usa el Banco Nacional de Chipre y John Garcin. Freddy se suicida cuando se da cuenta de que el Ejército Oscuro lo persigue. Darlene ha caído en la adicción por la culpa por la desaparición de Angela (Elliot no puede mostrarle la prueba de su muerte). Elliot investiga a John Garcin, pero es una trampa. Tres hombres se llevan a Elliot y le inyectan algo. Él cree que está a punto de morir. Los hombres lo reaniman y Price se revela.",
      "preview": "/episodes/33.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c686cea1-417f-4403-b07f-292d55ba982d"
    },
    {
      "no_all": 34,
      "title": "402 Payment Required",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2019-10-13",
      "us_milions_viewers": 0.34,
      "plot": "Price lleva a Elliot a su escondite y le cuenta sobre un grupo que financia al Ejército Oscuro conocido como Deus, que Zhang había construido a nivel mundial durante décadas. Price sabe que la ex empleada de E-Corp, Susan Jacobs, tenía vínculos con el Ejército Oscuro antes de su desaparición y le dice a Elliot que consiga el dinero del grupo Deus a través de ella. Elliot recibe una llamada de Darlene diciéndole que su madre ha muerto. Descubren que su madre tenía una caja de seguridad, pero el banco se deshizo de ella antes de su muerte. Darlene admite que está realmente de luto por Angela. Después del funeral, Darlene le confiesa a Elliot que mató a Susan Jacobs y se une a él contra Whiterose. Ella le agradece por cuidar de Vera, que ha regresado. Elliot discute con Mr. Robot, y ambos niegan tener conocimiento del regreso de Vera. En su mente, la madre de Elliot le dice a una versión más joven de sí mismo que espere a 'la otra'. Mientras tanto, Dominique le miente al FBI sobre lo que le pasó a Santiago, solo para que su interrogador sea asesinado en un falso suicidio por Janice. Price le dice a Zhang que renunciará a E-Corp y, por lo tanto, cortará lazos con el Ejército Oscuro, lo que obligará al grupo Deus a reunirse en persona para elegir a su sucesor.",
      "preview": "/episodes/34.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/37654214-bab4-408d-b9a2-a67bf9b456ba"
    },
    {
      "no_all": 35,
      "title": "403 Forbidden",
      "directed_by": "Sam Esmail",
      "written_by": "Courtney Looney",
      "air_date": "2019-10-20",
      "us_milions_viewers": 0.29,
      "plot": "En la víspera de Navidad, Wang Shu le aconseja a Zhang que cancele la reunión del Grupo Deus. En cambio, fija la reunión para el día siguiente. Zhang recuerda que su ex amante Chen se suicidó después de su matrimonio forzado. Zhang decide convertir a Tyrell en director ejecutivo de E-Corp. Elliot se acerca a Krista en la calle, pero ella lo empuja con miedo. Elliot y Darlene discuten sobre el plan. Elliot y Mr. Robot piratean a Olivia Cortez, empleada del Banco de Chipre. Al encontrarla en un bar, Mr. Robot le compra una bebida. Hablan de sus familias antes de que Elliot la bese y ella lo lleve a casa. El informante de Vera que vigila a Elliot entrega una foto de Elliot y Krista a la carnicería desde donde Vera contrabandea drogas. Vera le dispara por no ser confiable. Mientras Olivia duerme, Elliot obtiene una contraseña que necesita y se la envía a Darlene. Olivia se acerca a él y le cuenta sus problemas con las drogas y la autolesión. De camino a Allsafe, Elliot le menciona a Mr. Robot que una camioneta blanca los está siguiendo. Cuando Elliot se dirige a su casa, descubre que Tyrell ha entrado en su apartamento. Antes de que Elliot pueda advertirle que es probable que el Ejército Oscuro esté escuchando, Tyrell revela que será el director ejecutivo de E-Corp y que su puesto les permitirá derrotar al Ejército Oscuro.",
      "preview": "/episodes/35.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/27299846-cf1b-4d26-88cd-586689cad60f"
    },
    {
      "no_all": 36,
      "title": "404 Not Found",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2019-10-27",
      "us_milions_viewers": 0.34,
      "plot": "Tyrell noquea al agente del Ejército Oscuro en la camioneta blanca. En una gasolinera remota, Tyrell y Elliot salen y encuentran que la camioneta y el agente se han ido. Perdidos en un bosque y caminando en un círculo gigante, acuerdan que no pueden empezar de nuevo ni salir. Tyrell quiere darse por vencido cuando Elliot admite que nunca se preocupó por él; sigue adelante por el bien de Darlene y quiere advertirle antes de que el Ejército Oscuro lo mate. Darlene se da cuenta de que el acceso de Olivia no es suficiente y que el banco debe ser pirateado directamente. Al ver que entran al apartamento de Elliot, Darlene teme que Elliot esté muerto. Intenta robar un coche y termina llevando a un voluntario del hospital de niños, Santa. Admite que lo único que le queda es su hermano, a quien todavía ama, a pesar de estar furiosa con él. Dominique tiene una pesadilla en la que una mujer a la que invitó la ahoga en una bañera y se pone una máscara del Ejército Oscuro. Al despertar, Dominique parece recuperar su determinación. Elliot, Tyrell y Mr. Robot descubren que la camioneta ha golpeado a un ciervo; El agente del Ejército Oscuro les dispara antes de suicidarse. Tyrell recibe un disparo en el estómago y le dice a Elliot que termine con él y se encargue de Whiterose. Al caminar hacia el bosque, Tyrell, moribundo, encuentra una luz mientras la pantalla se vuelve blanca.",
      "preview": "/episodes/36.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/86d7adaa-6025-4bba-a1ad-23f8c9e2737d"
    },
    {
      "no_all": 37,
      "title": "405 Method Not Allowed",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-11-03",
      "us_milions_viewers": 0.31,
      "plot": "En la mañana de Navidad, Elliot quema la furgoneta y Darlene lo recoge. Elliot y Darlene, haciéndose pasar por un empleado, entran en Virtual Realty, la empresa que mantiene los servidores del Banco Nacional de Chipre. Elliot instala un hack de firmware que les da 40 minutos para obtener la información que necesitan mientras desactiva temporalmente las cámaras de seguridad. Elliot, que está a punto de ser atrapado, provoca un corte de energía, lo que les ayuda a escapar. El equipo de seguridad llama a la policía cuando se dan cuenta de que han sido infiltrados, pero solo ven a Elliot. Él lidera a la policía en una persecución a pie por Central Park. Darlene puede salir caminando, ahora haciéndose pasar por una asistente del gimnasio, y recoger a Elliot después de que es atropellado por un automóvil y salta una barandilla de protección. Janice envía a Dominique al departamento de policía local para darle al Ejército Oscuro el control sobre la investigación de la furgoneta. Mientras se reúne con su familia, el incidente de Central Park está en las noticias. Janice la envía nuevamente para capturar de inmediato a Darlene y Elliot, vistos en una cámara de tráfico. Elliot le envía un mensaje de texto a Price diciéndole que Tyrell no asistirá a la reunión. Price sigue pistas que le llevan a la ubicación de la reunión del Grupo Deus esa noche y responde que se llevará a cabo con o sin Tyrell. Krista se enfrenta a Vera.",
      "preview": "/episodes/37.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c1a6c9e2-cc95-41b4-9800-697303b5d00d"
    },
    {
      "no_all": 38,
      "title": "406 Not Acceptable",
      "directed_by": "Sam Esmail",
      "written_by": "Amelia Grey",
      "air_date": "2019-11-10",
      "us_milions_viewers": 0.36,
      "plot": "Vera toma a Krista como rehén y la interroga sobre Elliot. Elliot le trae café a Olivia después de conseguir drogas de Leon en la cafetería, le cuenta sobre el Grupo Deus y le pide ayuda. Cuando ella se niega, él revela que le ha añadido Oxycontin en el café, sabiendo que perderá a su hijo si no se mantiene limpia. Dominique sostiene a Darlene a punta de pistola y llama a Janice, quien le dice que mate a Darlene, ya que solo es necesario su teléfono con la ubicación de Elliot. Dominique deja inconsciente a Darlene y la arroja a una bañera. Elliot intenta obligar a Olivia a llamar a su compañero de trabajo, quien puede darle acceso a la información más clasificada del Banco Nacional de Chipre. Ella va al baño y se corta las muñecas, pero Elliot puede evitar que se desangre. Llama a su compañero de trabajo después de darse cuenta de que el Grupo Deus estaba relacionado con la muerte de su madre. Krista le da a Vera sus archivos sobre Elliot. Darlene recupera la conciencia e intenta razonar con Dominique. Dominique le dice a Darlene que la mate para que su familia se libre de la ira del Ejército Oscuro, pero Janice llega. Darlene revela que borró su teléfono. Krista llama a Elliot y le advierte que Vera viene. Él le dice que se reúna con él en Washington Square, sabiendo que Vera estará allí. Elliot es secuestrado en la calle por los hombres de Vera.",
      "preview": "/episodes/38.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/0496622d-91e8-40de-80ce-b816fbae5ca4"
    },
    {
      "no_all": 39,
      "title": "407 Proxy Authentication Required",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-11-17",
      "us_milions_viewers": 0.36,
      "plot": "Vera le ofrece a Elliot, atado a una silla, un puesto a su lado para tomar el control de Nueva York. Vera lleva a Elliot ante Krista e insiste en conocer a Mr. Robot. Mr. Robot se acerca y se ofrece a ayudar a Vera si deja ir a Krista, pero Vera protesta. Elliot le ofrece a Vera el dinero del hackeo de Chipre. Mientras Vera y sus hombres están distraídos por los detalles del hackeo, Elliot saca el arma de su bolso, pero los hombres de Vera ya la habían descargado. Mr. Robot intenta razonar con Vera, quien amenaza con dispararle a Krista hasta que Elliot admite que la necesita. Vera desata a Krista y la obliga a ella y a Elliot a tener una sesión de terapia improvisada. Elliot cree que Mr. Robot y Krista le están ocultando un secreto e insta a Vera a leer sus archivos. Krista le pregunta a Elliot sobre el día en que saltó por la ventana cuando era niño, revelando que Mr. Robot siempre ha existido, protegiendo a Elliot de su padre. Elliot finalmente recuerda que su padre abusó de él, a pesar de que Mr. Robot manipuló su memoria para hacerle creer que era un buen hombre. Vera intenta consolar a Elliot, revelando su propio pasado con abusos sexuales que involucraron a amigos de su madre. Él le confía su filosofía de que las personas que sufren como ellos se vuelven imparables. Elliot admite que no quiere estar solo y Vera le asegura que no lo está. Krista, acercándose sigilosamente, apuñala fatalmente a Vera por la espalda.",
      "preview": "/episodes/39.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2710a368-cc26-4494-a934-033b2a5bccbd"
    },
    {
      "no_all": 40,
      "title": "408 Request Timeout",
      "directed_by": "Sam Esmail",
      "written_by": "Robbie Pickering",
      "air_date": "2019-11-24",
      "us_milions_viewers": 0.37,
      "plot": "Elliot y Krista escapan de su apartamento antes de que los hombres de Vera regresen y encuentren su cuerpo. Krista se dirige a la estación de policía, pero Elliot sigue a una versión más joven de sí mismo hasta el Museo de Queens. Allí, encuentra la llave de su padre para el dormitorio de su infancia, ahora recordando que la había escondido en una de las paredes como su forma de defenderse. Una hora antes de que el Grupo Deus se reúna, Mr. Robot se disculpa con Elliot por no haberlo protegido; Elliot admite que lo creó para ser el padre que necesitaba. Elliot se derrumba mientras Mr. Robot lo consuela. Janice ata a Darlene y Dominique, ordenándole a Darlene que restaure su teléfono para poder encontrar a Elliot. Janice apuñala a Dominique, diciéndole a Darlene que entregue a Elliot o Dominique morirá. Janice llama a su equipo, amenazando con matar a los miembros de la familia de Dominique. Darlene cede y pide su teléfono. Los hombres de Janice no encuentran a Elliot en el apartamento de Krista. Ella llama a su equipo fuera de la casa de Trudy, pero nadie responde al teléfono. Janice se entera de que Dominique envió a Deegan y a la mafia irlandesa para rescatar a su familia y llevarlos a una casa segura, matando a los agentes del Ejército Oscuro en el proceso. Mientras Janice está distraída, Dominique logra dispararle en la cabeza. Dominique pide refuerzos y le dice a Darlene que encuentre a Elliot.",
      "preview": "/episodes/40.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2b3e83f0-6967-4be1-8da9-d807b8047dd4"
    },
    {
      "no_all": 41,
      "title": "409 Conflict",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2019-12-01",
      "us_milions_viewers": 0.36,
      "plot": "En la mente de Elliot, Mr. Robot discute con Magda y Young Elliot sobre revelar todo a pesar de que Elliot aún no se ha despertado, diciendo que Mr. Robot puede mostrarle lo que Elliot ha hecho y Darlene podría ser capaz de despertarlo. Mr. Robot y Darlene se preparan para hackear el Grupo Deus; Price les da información sobre la máquina de Whiterose para que puedan destruirla para Angela. Zhang, sospechando que Price y Elliot están planeando algo, mueve en secreto la ubicación de la reunión del Grupo Deus y se encuentra con Price a solas en la ubicación original, aunque Zhang se alarma cuando Tyrell está ausente. Al descubrir la nueva ubicación de la reunión, Mr. Robot envía a Darlene allí mientras él se queda para obtener la información de Zhang. Mr. Robot llama a Zhang al teléfono de Price. Zhang dice que Angela puede ser traída de vuelta, lo que hace que Elliot reaparezca, pero rechaza la oferta. Darlene publica un video de fsociety exponiendo públicamente al Grupo Deus y su ubicación, tomando sus datos cuando llaman a sus conductores para que los recojan. Elliot hackea una torre de telefonía móvil cercana para obtener los datos de Zhang y el Grupo Deus es asaltado. Price se burla de Zhang, diciendo que todo esto ocurrió porque Angela sigue viviendo con sus seres queridos. Zhang le dispara a Price y ve a Elliot mientras se va. El FBI llega a la residencia de Whiterose y se escuchan disparos fuera de su habitación mientras se maquilla.",
      "preview": "/episodes/41.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/7e305347-300a-42f1-9dc5-74fab6a0b9dd"
    },
    {
      "no_all": 42,
      "title": "410 Gone",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-08",
      "us_milions_viewers": 0.45,
      "plot": "Tras el hackeo del Grupo Deus, la identidad de Zhang como Whiterose se ha hecho pública. Dominique se ha recuperado casi por completo y deja el hospital. Bajo investigación del FBI por sus acciones como agente del Ejército Oscuro, no se le permite ver a su familia. Darlene la convence de huir con ella y Elliot, para esconderse del Ejército Oscuro. En cambio, Elliot se va solo a la planta de Washington Township. Leon transporta a Darlene y Dominique al aeropuerto, dándole consejos a Dominique sobre cómo vivir con una nueva identidad. Darlene transfiere una parte sustancial del dinero del Grupo Deus a todos los que tienen cuentas Ecoin, viéndolo como justicia. Dominique se asusta al ver a Irving en la librería del aeropuerto, promocionando su nueva novela. Él le informa que al Ejército Oscuro ya no le importan ella ni Darlene. Sin esa amenaza, Dominique decide no volar a Budapest con Darlene, ya que tiene un trabajo y una familia que cuidar. En la puerta, Darlene tiene un ataque de pánico por estar sola y huye al baño, extrañando a Dominique, quien se dio la vuelta para subir al avión. Darlene se tranquiliza y se recupera sola, pero pierde el vuelo. Dominique por fin consigue dormir un poco mientras el avión despega para comenzar de nuevo.",
      "preview": "/episodes/42.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/13c7dc86-8b11-4b39-ac7d-0d290c050c7e"
    },
    {
      "no_all": 43,
      "title": "eXit",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-15",
      "us_milions_viewers": 0.44,
      "plot": "Los hombres de Whiterose matan a los agentes del FBI enviados por Zhang, mientras ella proclama que ahora solo existe Whiterose. Elliot encuentra la planta nuclear de Washington Township aparentemente desierta. Activa su truco para destruir la máquina de Whiterose, pero es encontrado por agentes del Ejército Oscuro, quienes lo llevan más allá de los empleados asesinados hasta Whiterose. Discuten sobre la naturaleza de las personas, el odio y el mundo. Whiterose afirma que su máquina creará un mundo mejor. Elliot dice que aquellos que lo aman, incluso cuando se odia a sí mismo, hacen que valga la pena salvar el mundo. Whiterose ya ha activado la máquina, lo que desencadena una crisis. Ella dice que Elliot tiene una opción y se suicida. Elliot juega un juego de aventuras que Whiterose le dejó en una computadora vieja, pensando que puede detener la crisis, pero parece ser demasiado tarde. Él y Mr. Robot expresan su amor mutuo mientras todo se vuelve rojo. En un mundo alternativo, Elliot es optimista y feliz, director ejecutivo de AllSafe, comprometido con Angela y hijo único, uno con una relación amorosa con su padre aún vivo. Zhi Zhang es una mujer querida y rica conocida por su filantropía. Elliot consigue una cuenta importante con F Corp después de decir que siempre apoyará a Tyrell, quien es el director ejecutivo de F Corp. Elliot regresa a casa, sorprendido de ver a Elliot con una sudadera con capucha, a quien no reconoce, sentado frente a su computadora. Pide ayuda, pero le dicen que espere al próximo episodio. A Elliot le dicen que espere al próximo episodio.",
      "preview": "/episodes/43.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/65f7f301-87e0-4355-9643-8657ddb7f085"
    },
    {
      "no_all": 44,
      "title": "whoami",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-22",
      "us_milions_viewers": 0.46,
      "plot": "Elliot se despierta en un terreno abandonado tras la explosión en la planta de Washington Township, que ya no está allí. Descubre que la ciudad es un suburbio próspero, donde viven su madre y su padre, ambos vivos. Descubre que sus padres nunca abusaron de él cuando era niño y que Darlene no existe. Regresa a la ciudad, donde se encuentra con los padres de Angela, Emily y Phillip (este último todavía está en la vida de Angela), y le revelan que Elliot se casará con Angela al día siguiente. Va al apartamento del Elliot alternativo y piratea su computadora, descubriendo una unidad oculta de bocetos de él mismo, Darlene y el resto de fsociety. El Elliot alternativo regresa a casa y encuentra al Elliot original en su iMac (como se muestra al final del episodio anterior). Inicialmente alarmado, el Elliot alternativo explica que los bocetos son de un personaje que creó que llevaría una vida emocionante como hacker justiciero, la misma vida que vive el Elliot original. Se tocan, lo que provoca otro terremoto, que hiere gravemente al Elliot alternativo. El Elliot alternativo recibe una llamada de Angela; al escucharla por primera vez desde su muerte, el Elliot original decide que puede tener la vida que siempre quiso y mata al Elliot alternativo.",
      "preview": "/episodes/44.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/65cfe4fc-bb5d-4d38-93f5-302f7b385477"
    },
    {
      "no_all": 45,
      "title": "Hello Eliot",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-22",
      "us_milions_viewers": 0.31,
      "plot": "Elliot esconde el cuerpo del Elliot alternativo en un contenedor de almacenamiento, con la intención de tomar el lugar del Elliot alternativo y casarse con Angela. Una oficial de policía, Dominique, intenta arrestar a Elliot después de descubrir el cuerpo del Elliot alternativo. Elliot escapa a Coney Island, donde descubre que no hubo boda. Mr. Robot le explica a Elliot que el mundo en el que se encuentran no es el mundo paralelo del que habló Whiterose, sino una ilusión creada por Elliot con la intención de mantener atrapado al 'verdadero Elliot'. Desconcertado y confundido, Elliot se despierta en la oficina de Krista. Krista (que es una manifestación de la mente de Elliot en este punto) explica que el Elliot que conocemos desde el comienzo de la serie no es el Elliot real, sino una persona llamada 'The Mastermind' que el Elliot real creó para lidiar con su rabia y enojo hacia el mundo. Sin embargo, esta persona decidió tomar el control y atrapó al Elliot real en el mundo utópico, deshaciéndose de Darlene, quien es la conexión más fuerte del Elliot real con la realidad; Krista explica que Mastermind debe devolver el control al verdadero Elliot, pero él se niega y el mundo se derrumba. Mastermind se despierta en el hospital, donde Darlene revela que Whiterose está muerta, su máquina fue destruida y ella sabía que Mastermind había tomado el control. Al aceptar su identidad, Mastermind regresa a la mente de Elliot con el resto de sus personajes. El verdadero Elliot se despierta en el hospital y es recibido por Darlene.",
      "preview": "/episodes/45.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/eacc8f97-9dfc-4513-a218-2f120b46db2f"
    }
  ],
  "season_1": [
    {
      "no_all": 1,
      "title": "eps1.0_hellofriend.mov",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2015-06-24",
      "us_milions_viewers": 1.75,
      "plot": "Elliot Alderson, un inepto social, trabaja en la empresa de ciberseguridad Allsafe. Por la noche, piratea redes sociales, información personal y registros bancarios, incluidos los de sus compañeros de trabajo, su terapeuta y un traficante de drogas. Elliot detiene un ataque DDoS contra el mayor cliente de Allsafe, E Corp. Identifica un archivo etiquetado como fsociety00.dat y un archivo de texto que le pide que no destruya el malware que encuentra oculto en el servidor de E Corp. Mr. Robot, el misterioso líder del grupo de hackers fsociety, se pone en contacto con Elliot en el metro. Fsociety invita a Elliot a unirse a ellos para iniciar una revolución digital; planean eliminar todos los registros de deudas que posee E Corp. Él está intrigado y finalmente acepta. Como su primer acto de colaboración con fsociety, Elliot proporciona al FBI un archivo cifrado que implica falsamente a Terry Colby, el propio director de tecnología (CTO) de E Corp como el orquestador del ataque.",
      "preview": "/episodes/1.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/b5129e2f-d5af-4986-b18c-8f4d9b92cbe7"
    },
    {
      "no_all": 2,
      "title": "eps1.1_ones-and-zer0es.mpeg",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2015-07-01",
      "us_milions_viewers": 1.73,
      "plot": "Elliot rechaza una oferta de trabajo de Tyrell Wellick, director técnico interino de E Corp. Elliot, cada vez más paranoico, consume más morfina de lo normal. Darlene lo visita en su casa para llevarlo a fsociety, sorprendiéndolo. Mr. Robot y fsociety quieren que Elliot destruya una instalación de respaldo fuera de línea de E Corp llamada Steel Mountain pirateando una planta de gas adyacente y provocando una explosión. Elliot se echa atrás porque no quiere arriesgar vidas. Shayla es la traficante de drogas y amiga de Elliot. Cuando Elliot se da cuenta de que Fernando Vera, el proveedor de Shayla, abusa de ella, Elliot recopila pruebas contra Fernando y lo entrega a la policía, a pesar de las instrucciones explícitas de Shayla de no hacerlo. Mientras tanto, Cisco, un socio desconocido del grupo de hackers chinos The Dark Army, piratea la computadora personal de Ollie con un CD. Elliot y Mr. Robot hablan sobre la pelea de Elliot con su padre: Elliot le contó a su madre sobre la enfermedad terminal de su padre, a pesar de haberle prometido a su padre que mantendría la enfermedad en secreto. El Sr. Robot empuja a Elliot desde una barandilla hacia la playa llena de rocas como castigo por no guardar el secreto de su padre.",
      "preview": "/episodes/2.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/fca2fdee-4a74-49c7-ae18-855fd391c703"
    },
    {
      "no_all": 3,
      "title": "eps1.2_d3bug.mkv",
      "directed_by": "Jim McKay",
      "written_by": "Sam Esmail",
      "air_date": "2015-07-08",
      "us_milions_viewers": 1.68,
      "plot": "Tyrell está furioso porque Scott Knowles fue elegido como director de tecnología. Para desahogarse, Tyrell le paga a un hombre sin hogar para que le permita golpearlo. Cisco exige que Ollie infecte Allsafe con el mismo CD. Elliot cree que ha terminado con fsociety. Tyrell seduce al secretario de su jefe e instala un software en su teléfono. Intentando ser más normal, Elliot le pide a Shayla que lo acompañe a una fiesta, ella acepta y se involucran románticamente. Durante la fiesta, fsociety filtra los correos electrónicos de E Corp que incriminan a Colby por encubrir una fuga de desechos tóxicos que causó leucemia en el padre de Elliot y la madre de Angela. Tyrell ata a su esposa embarazada y la amordaza con una bola a pedido de ella. Ollie confiesa tanto su infidelidad como las demandas de Cisco a Angela. Temiendo el robo de identidad, ella quiere que infecte Allsafe con el CD. Elliot regresa a una sociedad. El director ejecutivo de Allsafe, Gideon Goddard, sospecha de la historia de Elliot sobre el ataque a E Corp y comienza a investigar.",
      "preview": "/episodes/3.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/16d9395e-03e7-4da8-a909-93b4672a2b22"
    },
    {
      "no_all": 4,
      "title": "eps1.3_da3m0ns.mp4",
      "directed_by": "Nisha Gantra",
      "written_by": "Adam Penn",
      "air_date": "2015-07-15",
      "us_milions_viewers": 1.27,
      "plot": "Elliot tiene un nuevo plan para destruir las copias de seguridad en cinta de E Corp de sus datos en Steel Mountain, que implica piratear su sistema de control climático conectando una Raspberry Pi para aumentar lentamente la temperatura (evitando el sistema de control climático) hasta un punto en el que destruirá las copias de seguridad en cinta magnética, pero esto requiere acceso físico al centro de datos fuertemente fortificado. Elliot, Romero, Mobley y Mr. Robot van a Steel Mountain. Con su suministro de morfina cortado, Elliot comienza a tener graves síntomas de abstinencia que incluyen múltiples alucinaciones. Darlene y Trenton se quedan para contactar a Cisco (el ex novio de Darlene) y organizar un ataque de hackers simultáneo por parte del Ejército Oscuro en los sitios de respaldo de E Corp en China. Mientras tanto, Angela y Shayla consumen éxtasis, lo que resulta en que las dos se besen. A la mañana siguiente, Angela sabotea Allsafe usando la identificación de trabajo y la computadora de Ollie.",
      "preview": "/episodes/4.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c0311722-d709-441b-8e22-baf60c7d3766"
    },
    {
      "no_all": 5,
      "title": "eps1.4_3xpl0its.wmv",
      "directed_by": "Jim McKay",
      "written_by": "David Iserson",
      "air_date": "2015-07-22",
      "us_milions_viewers": 1.38,
      "plot": "Con la ayuda de fsociety, Elliot se infiltra en Steel Mountain mediante el uso de lo que él llama 'hazañas humanas'. Casualmente se encuentra con Tyrell y usa su ego para acceder al área restringida donde necesita conectar su Raspberry Pi cargada con el programa para anular el sistema de control climático y destruir las copias de seguridad en cinta de E Corp. Tyrell revela que sabe que Elliot incriminó al CTO, pero no lo delatará. El Ejército Oscuro se niega a atacar la instalación de respaldo en China, lo que pone en peligro el plan de fsociety. Mientras tanto, Tyrell y Joanna cenan con el candidato a CTO Scott y su esposa Sharon en un intento de encontrar sus debilidades. Tyrell se acerca sexualmente a Sharon en el baño. Angela deja a Ollie después de decirle que infectó Allsafe con el CD del hacker y se muda con su padre. Ella descubre que está profundamente endeudado por las viejas facturas médicas de su madre. Elliot encuentra el teléfono de Shayla en el suelo. Fernando Vera lo llama desde la cárcel para que se entere de ello y le insinúa que ha organizado el secuestro de Shayla. Culpa a Elliot de haberlo entregado a la policía.",
      "preview": "/episodes/5.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/39825f54-87ec-4a4d-807b-217c807a8d3f"
    },
    {
      "no_all": 6,
      "title": "eps1.5_br4ve-trave1er.asf",
      "directed_by": "Deborah Chow",
      "written_by": "Kyle Backstreet",
      "air_date": "2015-07-29",
      "us_milions_viewers": 1.25,
      "plot": "Shayla es secuestrada por el hermano de Vera para presionar a Elliot para que hackee a Vera y la saque de la prisión antes de que lo maten en el interior. Elliot visita a Vera para comprobar el sistema cibernético de la prisión y más tarde se da cuenta de que el hermano de Vera organizó el ataque interno. El director técnico interino Scott le revela a Tyrell que su esposa le contó sobre el incidente del baño, lo que lo humilló. Después de que Tyrell destroza su cocina con rabia, Joanna explica que el deseo de Sharon de ser deseada es su vulnerabilidad. Angela se reúne con abogados en un intento de reabrir su demanda por residuos tóxicos contra E Corp; le dicen que es imposible ganar sin el testimonio de alguien de adentro. Elliot saca a Vera de la cárcel y Vera mata inmediatamente a su hermano. Cuando Elliot pregunta por Shayla, Vera le arroja las llaves del auto y dice: 'Ella estuvo contigo todo el tiempo'. Elliot abre el maletero y encuentra a Shayla adentro con la garganta cortada.",
      "preview": "/episodes/6.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/3561d63d-c066-4fd0-8d8c-b1098d4857dd"
    },
    {
      "no_all": 7,
      "title": "eps1.6_v1ew-s0urce.flv",
      "directed_by": "Sam Esmail",
      "written_by": "Kate Ericson",
      "air_date": "2015-08-05",
      "us_milions_viewers": 1.15,
      "plot": "Flashback: Shayla se muda a la casa de al lado y le da a Elliot un pez mascota. Quiere ser su amiga a pesar de su torpeza con la gente. Se ofrece a contactar a un proveedor de suboxone para Elliot. En el presente, ha pasado un mes desde el asesinato de Shayla. Angela hace un trato: mentirá y dirá que rompió la cadena de custodia con el archivo .dat que incriminó a Terry Colby, si a cambio, Colby testifica que E Corp encubrió la fuga de residuos tóxicos en 1993. Gideon advierte a Angela que su plan dejará a Allsafe fuera del negocio. Mientras tanto, Darlene y Mr. Robot intentan volver a unir a fsociety. Ella organiza una reunión en persona con la misteriosa Whiterose, líder del Ejército Oscuro. Tyrell, en una fiesta que celebra el ascenso de Knowles, atrae a Sharon a una azotea aislada y la estrangula mientras la seduce. Elliot le confiesa a su terapeuta que hackea a todo el mundo en un intento de encontrar una forma de salir de la soledad.",
      "preview": "/episodes/7.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/1c2d081c-6d5f-464b-876b-29aa90d4612e"
    },
    {
      "no_all": 8,
      "title": "eps1.7_wh1ter0se.m4v",
      "directed_by": "Christoph Schrewe",
      "written_by": "Randolph Leon",
      "air_date": "2015-08-12",
      "us_milions_viewers": 1.24,
      "plot": "Darlene roba un arma y tiene una conversación con Angela que implica que son amigos desde hace mucho tiempo. Elliot y fsociety vuelven a planificar su ataque, pero aún necesitan al Ejército Oscuro. Elliot conoce a Whiterose, una mujer transgénero obsesionada con el tiempo, que dice que el Ejército Oscuro se echó atrás porque Gideon, sospechoso de la historia de Elliot, convirtió el servidor pirateado de E Corp en un honeypot. Con la ayuda de Darlene, Elliot cierra esto. Tyrell encuentra el archivo .dat de fsociety después de que Gideon le habla del honeypot y se reúne con Mr. Robot, y parece que los dos están trabajando juntos. Le recuerda a Mr. Robot que conoce su 'pequeño secreto sucio' cuando Mr. Robot se niega a cooperar, a lo que Mr. Robot se encoge de hombros. Cuando la policía interroga a los Wellicks sobre el asesinato de Sharon, Joanna rompe en secreto su propia fuente con un tenedor para distraerlos. Elliot le cuenta a Darlene sobre el éxito de su plan, y una extasiada Darlene le dice que lo ama. Él besa a Darlene, quien se indigna. Ella le pregunta si 'se había olvidado otra vez'. Elliot se da cuenta de que Darlene es su hermana, pero no tiene ningún recuerdo de ella. Encuentra un CD que contiene viejas fotos familiares, lo que revela que Mr. Robot es su padre.",
      "preview": "/episodes/8.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/4458d529-5123-453e-a603-c21dc6f758d3"
    },
    {
      "no_all": 9,
      "title": "eps1.8_m1rr0r1ng.qt",
      "directed_by": "Tricia Block",
      "written_by": "Sam Esmail",
      "air_date": "2015-08-19",
      "us_milions_viewers": 1.32,
      "plot": "Un flashback muestra a un joven Elliot y a su padre en su taller de reparación de ordenadores, 'Mr. Robot'. Después del nacimiento de su hijo, Joanna le dice a Tyrell que necesita mantener el control si 'quiere ser parte de esta familia'. Tyrell es despedido de E Corp - su último acto es evitar que Gideon revierta el honeypot. Mr. Robot hace un viaje con Elliot a la casa de su infancia. Enfadado, Elliot empuja a Mr. Robot por una ventana y luego lo lleva a un cementerio. Mr. Robot le dice a Elliot que no deje que Angela y Darlene 'se deshagan de él', y que siempre lo amará. Cuando llegan, Elliot, solo en la tumba de su padre, se da cuenta de que había asumido la personalidad de su padre muerto todo el tiempo, diciendo 'Soy Mr. Robot'. Terry Colby le ofrece a Angela un trabajo en E Corp. Elliot ahora duda de la continuación de su plan Mr. Robot/fsociety. Tyrell amenaza a Elliot sobre el plan de fsociety - Elliot lleva a Tyrell a la sala de juegos y entiende que continuará con el hack. Acuerdan trabajar juntos, pero Elliot mira la máquina de palomitas de maíz donde está escondida la pistola de Darlene.",
      "preview": "/episodes/9.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2e309bf1-2d57-43fc-8fe4-be6cd24d2b6a"
    },
    {
      "no_all": 10,
      "title": "eps1.9_zer0-day.avi",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2015-09-02",
      "us_milions_viewers": 1.21,
      "plot": "El psiquiatra de Elliot se encuentra con su ex novio, a quien Elliot hackeó y obligó a romper con ella. Intenta persuadirla para que ayude a la policía a arrestar a Elliot, pero ella se niega. Elliot se despierta solo en la camioneta de Tyrell tres días después de la conclusión del episodio anterior, sin recordar esos dos días. El hackeo de fsociety tuvo éxito, arrojando al mundo al caos y reuniendo multitudes que vitoreaban en toda la ciudad. fsociety encripta sus datos y cubre sus huellas. E Corp está preparando una entrevista televisiva de emergencia. El vicepresidente ejecutivo de tecnología de E Corp se suicida en la televisión después de afirmar que la situación es desesperada. Elliot habla con Mr. Robot nuevamente y le pregunta sobre la ubicación de Tyrell. Visita la dirección de Tyrell, pero solo encuentra a Joanna, presentándose como 'Ollie'. El episodio termina con Elliot abriendo la puerta de su apartamento; no se ve al visitante. En una escena post créditos, se muestra a Whiterose, vestida de hombre, y a Phillip Price, el director ejecutivo de E Corp, conversando en un evento formal donde Price indica que 'sabe quién es el responsable'.",
      "preview": "/episodes/10.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/3e58542a-35e3-4c0d-b678-50aa06fa06d5"
    }
  ],
  "season_2": [
    {
      "no_all": 11,
      "title": "eps2.0_unm4sk-pt1.tc",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-13",
      "us_milions_viewers": 1.04,
      "plot": "Un breve flashback muestra que Tyrell grabó un video de fsociety la noche que visitó a Elliot. Un mes después, Elliot se ha desconectado, vive con su madre y mantiene una rutina repetitiva en un intento de debilitar la influencia de Mr. Robot, quien se le aparece continuamente y lo atormenta mientras se niega a decirle lo que le sucedió a Tyrell. fsociety continúa bajo el liderazgo de Darlene, pirateando la casa inteligente de la asesora general de E Corp, Susan Jacobs, y usándola como base de operaciones después de obligar a Jacobs a mudarse. Gideon visita a Elliot, le dice que Allsafe ya no existe y que el FBI cree que él está detrás del hackeo o al menos es cómplice de alguna manera. Con la ayuda de Mobley, Darlene ejecuta un hackeo en el Banco de E Corp, reteniendo sus registros para pedir un rescate.",
      "preview": "/episodes/11.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2ce93a3e-9dab-427f-8241-2dd9fc66d966"
    },
    {
      "no_all": 12,
      "title": "eps2.0_unm4sk-pt2.tc",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-13",
      "us_milions_viewers": 1.04,
      "plot": "Como parte de la demanda de rescate, fsociety obliga a Scott Knowles a usar una máscara de fsociety y quemar públicamente los $ 5.9 millones del hackeo del episodio anterior. Angela continúa subiendo la escalera en E Corp, aparentemente contenta con su nuevo puesto corporativo, y parece abandonar la demanda. Joanna recibe un regalo en su puerta, una caja de música con un teléfono escondido debajo, pero pierde la llamada. Elliot descubre que ha estado actuando bajo la influencia de Mr. Robot mientras pensaba que estaba durmiendo. Un hombre llamado Brock asesina a Gideon, quien anteriormente había amenazado con informar el comportamiento sospechoso de Elliot en Allsafe al FBI y al agente Dominique DiPierro. Elliot se despierta de un estado disociativo en el teléfono, recibido en el otro extremo por Tyrell.",
      "preview": "/episodes/11.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2ce93a3e-9dab-427f-8241-2dd9fc66d966"
    },
    {
      "no_all": 13,
      "title": "eps2.1_k3rnel-pan1c.ksd",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-20",
      "us_milions_viewers": 0.79,
      "plot": "Un flashback revela que Romero quería alquilar la sala de juegos a Mobley, pero Mobley lo reclutó para fsociety. Después de una conversación confusa con Tyrell por teléfono, Elliot intenta deshacerse por completo de Mr. Robot. Las noticias informan de la muerte de Gideon, lo que sorprende a Elliot. Más tarde, Mobley encuentra a Romero muerto en casa. Mobley y Trenton temen que el Ejército Oscuro los esté persiguiendo y sospechan de Darlene y Elliot. Dominique DiPierro toma instantáneas de una lista encontrada en la mesa de la computadora en la escena del crimen que denota agentes del FBI y su información. Ray está a la caza de un ingeniero cibernético para sus propios propósitos siniestros y logra convencer a Elliot de que se abra sobre Mr. Robot. Elliot una vez más tiene problemas con el abuso de drogas y toma una cantidad obscena de Adderall, lo que lleva a un colapso mental. Phillip Price invita a Angela a cenar e intenta hacer que se tome las cosas de manera menos personal. Dominique decide continuar con la investigación de Romero después de encontrar su nombre en la lista; Mientras visita a la madre de Romero, encuentra un cartel de la 'Fiesta del Fin del Mundo', que la lleva a la sala de juegos de fsociety.",
      "preview": "/episodes/13.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/8ea9de87-2d33-4592-849c-1ee39d3d3827"
    },
    {
      "no_all": 14,
      "title": "eps2.2_init_1.asec",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-07-27",
      "us_milions_viewers": 0.63,
      "plot": "En Halloween del año anterior, Mr. Robot apareció por primera vez y le sugirió el hack a Darlene mientras Elliot usaba la máscara de fsociety. En el presente, Elliot rechaza su pedido de ayuda. Mr. Robot afirma que si Elliot puede vencerlo en ajedrez, se irá para siempre. Aunque Krista lo desaconseja, Leon le dice que luche por lo que quiere; sin embargo, las tres partidas terminan en tablas. Dominique encuentra un casquillo de bala en la galería. Whiterose presiona a Price para que se mantenga a tiempo y monitorea al FBI. Angela asume que Price quiere que ella ayude a resolver la demanda colectiva por la fuga tóxica después de que ella delate a los otros ejecutivos, pero él rechaza su teoría. Joanna se está quedando sin fondos por pagarle al encargado del estacionamiento que encontró la camioneta de Tyrell durante el hack para que se quede callado. Scott rechaza su oferta de testificar contra Tyrell a cambio de la indemnización por despido de Tyrell. Cisco le dice a Darlene que el Ejército Oscuro no habría matado a Romero, cuyo asesinato podría tener algo que ver con un programa de vigilancia ilegal del FBI llamado Proyecto Berenstain. Elliot acepta ayudar a Ray, pero usa secretamente la computadora para contactar a Darlene y hackear al FBI.",
      "preview": "/episodes/14.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/b9515a8a-e6e8-4a61-a87f-b303954afe77"
    },
    {
      "no_all": 15,
      "title": "eps2.3_logic-b0mb.hc",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2016-08-03",
      "plot": "Elliot escribe el malware del FBI desde la computadora de Ray. Darlene le dice a Angela que pueden borrar los registros del FBI que la conectan con el CD de Allsafe si ayuda, pero ella se niega. El encargado del estacionamiento que encontró la camioneta de Tyrell teme que el FBI esté tras él, por lo que Joanna ordena que lo maten. Elliot le dice a Ray que debe comunicarse con su especialista en TI anterior, 'RT'; Ray acepta de mala gana y trae a RT. Dominique y su equipo viajan a China para investigar la participación del Ejército Oscuro en Five/Nine. Allí, conocen al Ministro Zhang, el Ministro de Seguridad del Estado chino, que en realidad es Whiterose. Después de que Dominique y Zhang tienen una conversación privada por la noche, unos hombres armados atacan la oficina a la mañana siguiente, matando a la mayoría del equipo de Dominique. Joanna recibe una llamada telefónica de alguien que respira con dificultad, posiblemente Tyrell. Después de que su ex novio Ollie la vende al FBI, Angela decide ayudar con el hack. Elliot le pregunta a RT qué le pasó y RT revela que Ray administra un sitio web del mercado negro que trafica con drogas, armas y esclavas sexuales. Esa noche, unos matones irrumpen en la casa de Elliot, lo arrastran a la calle y lo golpean mientras Ray le recuerda que le advirtieron que no mirara.",
      "preview": "/episodes/15.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/7b9c5f29-4ef3-471d-8196-1192d1443c48"
    },
    {
      "no_all": 16,
      "title": "eps2.4_m4ster-s1ave.aes",
      "directed_by": "Sam Esmail",
      "written_by": "Adam Penn",
      "air_date": "2016-08-10",
      "us_milions_viewers": 0.57,
      "plot": "Elliot vive una versión retorcida de una comedia de situación de los años 90 de un viaje familiar por carretera con Tyrell encerrado en el maletero, con ALF. Mr. Robot lo anima a mantener la vista hacia adelante hasta que esté listo para despertar en el hospital. Ray le hace saber que es el amo de Elliot. Al ser encerrado por Lone Star, Elliot abraza a Mr. Robot por proteger su mente durante la paliza. Un flashback revela que, el día que el padre de Elliot le dijo que lo habían despedido por estar enfermo, también dejó que Elliot le pusiera nombre a su nueva tienda de computadoras. Cisco recibe equipo del Dark Army para el hackeo del FBI de fsociety, pero le rompen una aguja hipodérmica en el dedo por hacer demasiadas preguntas. Dominique se salvó del tiroteo, ya que ambos atacantes se suicidaron. Aunque se culpa del ataque a los separatistas chinos, ella está decidida a investigar al Dark Army. El Congreso se niega a seguir adelante con el plan de rescate de Phillip Price para pedir prestado a China porque cuatro agentes del FBI fueron asesinados allí. Darlene y Mobley le enseñan a Angela a hackear el FBI, pero Dominique aparece justo antes de que pueda terminar.",
      "preview": "/episodes/16.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/a0ecc8fd-7608-4d1d-82c1-721027b0fbbf"
    },
    {
      "no_all": 17,
      "title": "eps2.5_h4ndshake.sme",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-08-17",
      "us_milions_viewers": 0.68,
      "plot": "Dominique se entera de la historia de Angela y sospecha cuando el FBI es hackeado. Angela confronta a Darlene sobre ella y Elliot creando fsociety después de recordar que las máscaras se originaron en una película que vieron muchas veces cuando eran niños. Angela resuelve la demanda de E Corp v Washington Township y, a través de Price, es reasignada a la división de Gestión de Riesgos. Pero sobrepasa los límites en su primera reunión de directores. fsociety puede interrumpir la votación de rescate de Price. Mr. Robot le admite a Elliot que dispararon a Tyrell. Elliot arregla el sitio web de Ray, pero también alerta al FBI a través de Internet después de ver que están vendiendo esclavos, drogas y armas pesadas en la Dark Net. Ray se da cuenta de lo que Elliot ha hecho y, sintiendo remordimiento, deja ir a Elliot cuando llega el FBI. Mr. Robot anima a Elliot a ser un líder, haciendo las paces con él para beneficiarlos a ambos. Una pandilla ataca a Elliot por cerrar el sitio web de Ray, pero Leon los detiene; trabaja para el Ejército Oscuro, protegiendo a Elliot para Whiterose. Leon le dice a Elliot que recibirá una carta y que haga lo que dice. Elliot le admite a Krista que sabe que nunca estuvo en casa de su madre, y el espectador finalmente se entera de que está en prisión.",
      "preview": "/episodes/17.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/a36d13b9-a1dd-436d-bc12-ee4f9864096d"
    },
    {
      "no_all": 18,
      "title": "eps2.6_succ3ss0r.p12",
      "directed_by": "Sam Esmail",
      "written_by": "Courtney Looney",
      "air_date": "2016-08-24",
      "us_milions_viewers": 0.74,
      "plot": "FSociety se entera de que el Proyecto Berenstain es una vigilancia ilegal de tres millones de personas para la investigación Five/Nine que ha dado lugar a 16 sospechosos principales, uno de ellos fallecido. Mobley teme que Romero sea el sospechoso muerto, lo que significa que el FBI está cerca de ellos. fsociety divulga esta información, lo que causa problemas para el FBI, pero Susan Jacobs llega a casa y los ve. La atan e intentan hackearla para obtener información de chantaje, pero Darlene recuerda a Susan riéndose cuando E Corp fue absuelta en el caso de la fuga tóxica que mató a su padre. Darlene la electrocuta con una pistola eléctrica, fatalmente debido a la condición cardíaca de Susan, y afirma que fue en defensa propia, un accidente. Darlene y Cisco incineran el cuerpo de Susan mientras Mobley y Trenton entran en pánico. Dominique entrevista al dueño del arma robada de Darlene y lleva a Mobley para interrogarlo sobre la sala de juegos, todavía buscando a Tyrell. Él no le da nada y Dominique se ve obligada a dejarlo ir. Mobley le advierte a Trenton que deben correr, pero llega dos horas tarde a su reunión con Trenton, aunque alguien la encuentra. El amorío de Angela era una infiltración del FBI, pero ella lo abandonó por un hombre mayor. Darlene ve que Cisco está informando sobre ella al Ejército Oscuro y lo ataca con un bate de béisbol.",
      "preview": "/episodes/18.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/04004fbd-ddad-416f-87a3-55a980f8a089"
    },
    {
      "no_all": 19,
      "title": "eps2.7_init_5.fve",
      "directed_by": "Sam Esmail",
      "written_by": ["Kyle Bradstreet", "Lucy Teitler"],
      "air_date": "2016-08-31",
      "us_milions_viewers": 0.65,
      "plot": "El golpe a la puerta de Elliot era la policía para arrestarlo por hackear a Lenny, el ex de Krista, y robarle su perro. Se declara culpable; está en la cárcel al día siguiente con Ray como director, estableciendo su ilusión. A pesar de que su sentencia es de 18 meses, es liberado 86 días después debido a las medidas de control de costos. Darlene le informa que Mobley y Trenton están desaparecidos. A través de Cisco, hackean el teléfono de un agente del Ejército Oscuro para monitorear conversaciones que se refieren a una 'Etapa 2'. Angela hackea E Corp ella misma, descubriendo que la fuga de desechos tóxicos en la planta de Washington Township no se arregló, aunque se vuelve demasiado sospechosa para ser una denunciante; Dominique le dice que se está quedando sin opciones. Darlene dejó una cinta de fsociety con su cara en la casa de Susan; Cisco la recupera y escucha a alguien. Whiterose había organizado la muerte del anterior director ejecutivo de E Corp por interferir con la planta. Price logra calmar a Zhang (Whiterose) diciéndole que puede quedarse con la planta si China le presta a E Corp algo de dinero de rescate como muestra de buena voluntad. Elliot y Mr. Robot se dan cuenta de que, de alguna manera, se están desconectando el uno del otro. Darlene escucha al Ejército Oscuro decir que la Etapa 2 es el plan de Elliot mientras alguien llama a su puerta. Joanna espera a Elliot afuera de su apartamento.",
      "preview": "/episodes/19.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/e41826d9-4c69-434e-be57-521fbef98475"
    },
    {
      "no_all": 20,
      "title": "eps2.8_h1dden-pr0cess.axx",
      "directed_by": "Sam Esmail",
      "written_by": ["Kor Adana", "Randolph Leon"],
      "air_date": "2016-09-07",
      "us_milions_viewers": 0.76,
      "plot": "Price hace que Colby mueva hilos políticos para permitir que China se anexione el Congo a cambio de un rescate financiero de E Corp. Cisco encuentra a uno de los miembros de fsociety gravemente herido y convence a Darlene de que necesita un hospital. Un testigo identifica a Cisco saliendo de la casa de Susan y las autoridades comienzan a investigar si sus vacaciones son realmente una desaparición. A pesar de las protestas de Dominique de que el Ejército Oscuro atacará, la imagen de Cisco se divulga a los medios como sospechoso de Five/Nine. El personal de urgencias del hospital ve más tarde la orden de búsqueda y captura, y reporta su ubicación. Joanna convence a Elliot de rastrear el teléfono que cree que dejó Tyrell. Elliot rastrea la llamada hasta una residencia cercana, pero el Sr. Sutherland cree que no será Tyrell según la ubicación. Elliot y Angela se encuentran más tarde en el metro para hablar. Ella le hace darse cuenta de que hay más lagunas en su memoria y le advierte que no confíe en Mr. Robot. Derrotada, Angela tiene la intención de confesar con su abogado, admitiendo su participación en el hackeo del FBI. Después de besarse con Elliot, se le acercan dos figuras. Dominique sigue a Darlene y Cisco hasta un restaurante, pero mientras está dentro, un tirador del Ejército Oscuro les dispara y ella sale del restaurante cubierta de sangre.",
      "preview": "/episodes/20.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/d1571aed-df0e-460c-a242-e50750d48efc"
    },
    {
      "no_all": 21,
      "title": "eps2.9_pyth0n-pt1.p7z",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-09-14",
      "us_milions_viewers": 0.68,
      "plot": "Dominique exige que se investigue el tiroteo como un posible acto de guerra por parte del Ejército Oscuro, pero le dicen que el gobierno no molestará a China después de que acaban de darle a los EE. UU. un préstamo de 2 billones de dólares. Joanna considera que la ubicación del teléfono es un gran regalo de Tyrell. Phillip Price usa el dinero del rescate para fortalecer Ecoin, obligando al gobierno a apoyarlo para seguir el ritmo de China y reconstruir el sector bancario. Angela es llevada a una casa donde una joven aparentemente torturada le hace una evaluación psicológica. Su captora es Whiterose, quien dice que Angela debería haber muerto hace meses; quiere que Angela crea en la causa de Whiterose y afirma que la madre de Angela y el padre de Elliot murieron por un bien mayor. Al regresar a la ciudad esa noche, Angela le dice a su abogado que nunca la vuelva a llamar. Elliot usa una técnica de sueño lúcido para ver a Mr. Robot decodificar un mensaje en el apartamento. Mientras lo sigue, Elliot toma el control de camino a un taxi que la espera. Para su sorpresa, Tyrell logra subir. A pesar de aceptar su destino, el taxista no reconoce directamente la existencia de Tyrell y echa a Elliot por entrar en pánico. Tyrell dice que el Ejército Oscuro tiene lista la Etapa 2 y que Elliot estará contento.",
      "preview": "/episodes/21.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/4fa76068-145f-4e97-ac17-00eb47b16b6d"
    },
    {
      "no_all": 22,
      "title": "eps2.9_pyth0n-pt2.p7z",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2016-09-21",
      "us_milions_viewers": 0.85,
      "plot": "Meses antes, Tyrell le rogó a Elliot que lo dejara participar del plan. En la actualidad, lleva a Elliot a un lugar discreto, al otro lado de la calle de donde se revela que E Corp está reuniendo todos sus registros en papel. Elliot se da cuenta de que la Etapa 2 implica diseñar una explosión en la instalación de respaldo para destruir permanentemente los datos de E Corp. Scott Knowles es el dueño del teléfono misterioso, engañando a Joanna para hacerla sufrir porque quería que ella sintiera lo que él sentía. Scott golpea a Joanna después de que ella calumnia a su esposa fallecida. Joanna convence a Derek para que incrimine a Scott por el asesinato de Sharon como venganza. Después del ataque del Ejército Oscuro, Darlene es interrogada por el FBI. Dominique le muestra que juega un papel importante en la investigación del FBI. Convencido de que Tyrell no es real, Elliot intenta deshacer el hack del firmware, pero Tyrell le dispara con el arma robada de Darlene. Angela recibe una llamada de un Tyrell angustiado a través del Ejército Oscuro, y se va para estar con Elliot cuando se despierta. En una escena post créditos, se revela que Mobley y Trenton se esconden en la Costa Oeste. Trenton le revela a Mobley que ha encontrado una forma de deshacer el ataque. Mientras Mobley expresa su deseo de dejar atrás el incidente, Leon se acerca a los dos y les pide que le den la hora.",
      "preview": "/episodes/22.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/f699b498-ad88-413f-b30c-560a7d769d8e"
    }
  ],
  "season_3": [
    {
      "no_all": 23,
      "title": "eps3.0_power-saver-mode.h",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-10-11",
      "us_milions_viewers": 0.68,
      "plot": "Zhang tiene la intención de que Elliot muera una vez que haya completado su trabajo para el Ejército Oscuro. En pánico por la muerte de Elliot, Tyrell llama al vendedor de autos usados ​​y agente del Ejército Oscuro Irving. Elliot se despierta una semana después en una habitación con Angela. Encuentra que el edificio de piratería de firmware está vacío. Darlene aparece y le sonsaca información, pero él miente y dice que Tyrell nunca estuvo involucrado. Con la energía aún cortada, ella lo lleva a un torneo de hackers clandestino con conexiones de fibra. Cierra la puerta trasera a E Corp, pero los agentes del Ejército Oscuro los obligan a irse. Irving sacude su cola del FBI y Elliot piensa que ha cancelado la Etapa 2. Pensando que su revolución empeoró las cosas, le pide a Angela un trabajo en E Corp para arreglar las cosas. Esa noche, Mr. Robot emerge y Angela lo lleva a trabajar con Irving y Tyrell, creando otra forma de avanzar en la Etapa 2. Angela planea manipular a Elliot junto con Mr. Robot, creyendo en el plan de Whiterose de deshacer todo lo que E Corp ha hecho y crear un mundo nuevo.",
      "preview": "/episodes/23.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/9cb3bf1d-228c-49d7-af09-834141018a44"
    },
    {
      "no_all": 24,
      "title": "eps3.1_undo.gz",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-10-18",
      "us_milions_viewers": 0.51,
      "plot": "Cinco semanas después, Elliot se abre camino dentro de E Corp, denunciando a los ejecutivos de menor rango y convenciendo a un gerente de nivel medio para que comience a digitalizar los registros en papel mientras traslada en secreto el resto del edificio de la Etapa 2 a un almacén de E Corp. Scott Knowles es arrestado por el asesinato de Sharon. Joanna aparece en televisión diciendo que siempre amará a Tyrell; Derek la mata y el Sr. Sutherland mata a Derek. Una fuente desconocida publica otro video de fsociety. Dominique y el FBI presionan a Darlene y revelan la llamada telefónica que Elliot le hizo a Tyrell desde la prisión. Darlene se queda a dormir en casa de Elliot, pero Mr. Robot aparece y la asusta. Phillip Price tiene a todas las naciones necesarias, excepto China, a bordo de Ecoin. Cuando Price intenta amenazar a Zhang con la votación de la ONU para permitir que China se anexione el Congo, Zhang revela su control sobre Angela. Zhang quiere que la Etapa 2 comience el día de la votación, ya sea que ganen o pierdan, para castigar a Price. Elliot deja salir a Mr. Robot durante una sesión de terapia donde le dice a Krista que él y Elliot estaban comprometidos. Lenny devuelve al perro enfermo. Elliot se da cuenta de que Darlene pinchó su ordenador y va a la casa segura del FBI de Darlene.",
      "preview": "/episodes/24.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/955d6b7a-e2a6-443e-8bda-07e94986778f"
    },
    {
      "no_all": 25,
      "title": "eps3.2_legacy.so",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-10-25",
      "us_milions_viewers": 0.54,
      "plot": "La noche del hack, Mr. Robot intenta dispararle a Tyrell, pero el arma se atasca. Tyrell convence a Mr. Robot de que lo necesita para la Etapa 2. Irving y el Ejército Oscuro aparecen, afirmando que Gideon le dijo al FBI que Tyrell cerró el honeypot, lo que lo convirtió en el principal sospechoso del hack. Llevan a Tyrell a una cabaña en un área aislada. La evaluación psicológica lo destroza, pero admite que siempre será leal a Elliot. Zhang comienza a trabajar tanto en Tyrell como en Elliot. Tyrell obtiene acceso seguro para diseñar la Etapa 2 con el firmware de Cisco. Los informes de que Joanna se está mudando hacen que Tyrell se enoje y salga a caminar, tras lo cual es arrestado por un oficial de policía local. El oficial es asesinado por el agente del FBI Santiago, otro agente del Ejército Oscuro y superior de Dominique, lo que garantiza que nadie sepa sobre Tyrell. Irving puede calmar a Tyrell, diciendo que puede recuperar a su familia cuando esto termine. Irving verifica a Elliot a través de Leon. Tyrell es llevado a un hotel controlado por el Ejército Oscuro y está emocionado de volver a encontrarse con Elliot. Después de tener que tranquilizarlo, Angela le explica a Tyrell la existencia de Mr. Robot. Después de la cirugía, Mr. Robot despierta y le sonríe a Tyrell por seguir el plan.",
      "preview": "/episodes/25.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/f3660ac0-52a0-42b8-8629-68e87fedd695"
    },
    {
      "no_all": 26,
      "title": "eps3.3_metadata.par2",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2017-11-01",
      "us_milions_viewers": 0.55,
      "plot": "Darlene es capaz de jugar con las sospechas de Elliot sobre ella al unirse por su desconfianza compartida hacia Mr. Robot. Elliot admite que la Etapa 2 nunca fue cancelada, sospechando que Mr. Robot emerge por la noche y le pide a Darlene que se esconda en el apartamento vacío de Shayla para seguirlo. Darlene se enfurece cuando ve a Mr. Robot irse con Angela. Tyrell ha perdido toda la fe en Elliot después de enterarse de los retrasos en el envío de los registros. Con tres días antes de que ocurra la Etapa 2, Angela dice que pueden mover todos los registros en papel durante el fin de semana. Ella tranquiliza a Elliot cuando emerge y los ve a Tyrell y a ella. Angela hace que Phillip Price despida a Elliot para evitar que interfiera. Tyrell quiere que él y su familia sean enviados a un lugar seguro en Ucrania después de la Etapa 2. Dominique captura la fuente del nuevo video de fsociety, todavía convencida de que realmente es Dark Army. Darlene promete seguir una pista, pero sin un cable y después de haberle hecho prometer a Elliot que se vengará si algo le sucede.",
      "preview": "/episodes/26.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/a00aba78-f6d2-4ed1-b54f-d87e0950d20d"
    },
    {
      "no_all": 27,
      "title": "eps3.4_runtime-error.r00",
      "directed_by": "Sam Esmail",
      "written_by": ["Kor Adana", "Randolph Leon"],
      "air_date": "2017-11-08",
      "us_milions_viewers": 0.52,
      "plot": "Sin ningún recuerdo de los últimos cuatro días, Elliot va a trabajar el día de la votación de la ONU. Se da cuenta de que lo han despedido y que la Etapa 2 se llevará a cabo hoy. Intenta evadir la seguridad para cerrarla, pero lo atrapan y lo escoltan hasta la salida. Intenta llamar con una amenaza de bomba para que evacuen el edificio objetivo, mientras una gran multitud de manifestantes anti E Corp se reúne en la sede. Darlene aparece, admitiendo que está trabajando con el FBI y que Angela está trabajando con Mr. Robot, ayudando a Elliot a recordar sus días perdidos. Los manifestantes irrumpen en E Corp, aterrorizando a los trabajadores. Irving llama a Angela, diciendo que el motín es una distracción para que puedan enviar a Elliot a copiar datos importantes de un HSM en una habitación segura como requisito previo a la Etapa 2. Angela se entera de que la ONU aceptó la anexión, luego se acerca un guardia de seguridad sospechoso. Ella atrae a los manifestantes, que atacan al guardia de seguridad, para poder completar la tarea destinada a Elliot, luego pasa los datos a un agente del Ejército Oscuro. Elliot la confronta en medio del caos y le pregunta si hay algo que ella necesite decirle.",
      "preview": "/episodes/27.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/b3f0b41c-a97f-4f58-89ea-76384f667452"
    },
    {
      "no_all": 28,
      "title": "eps3.5_kill-process.inc",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2017-11-15",
      "us_milions_viewers": 0.59,
      "plot": "Angela no le dice nada a Elliot, pero él se da cuenta de que Tyrell está en el restaurante Red Wheelbarrow; Darlene le transmite esta información a Dominique. Aunque el agente Santiago les impide hacerlo, Dominique y su compañero lo comprueban ellos mismos. Irving le da a Tyrell instrucciones escritas que lo molestan. Dominique encuentra el escondite de Tyrell en el restaurante, pero no lo alcanza. Mientras tanto, Elliot va al edificio objetivo de la Etapa 2 para evitar la explosión desde adentro, a pesar de que Mr. Robot lo retrasa constantemente y hace que Elliot se ataque a sí mismo. Darlene se enfrenta a Angela, amenazando con denunciarla al FBI, pero Angela insiste en que nadie saldrá herido. Elliot convence a Mr. Robot para que ayude cuando se dan cuenta de que los registros en papel no están en el edificio. Dominique ve a Tyrell arrestado en público, gritando para que detengan el ataque. Creyendo que ha detenido la Etapa 2, Elliot está reflexionando sobre el verdadero plan de Whiterose cuando ve informes de explosiones en las instalaciones de 71 E Corp a las que redirigió los registros en papel, dejando miles de muertos. Elliot se da cuenta de que él es responsable del aumento de la magnitud de la Etapa 2.",
      "preview": "/episodes/28.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c677f666-4e36-4038-b7b8-99649dc0bc3d"
    },
    {
      "no_all": 29,
      "title": "eps3.6_fredrick+tanya.chk",
      "directed_by": "Sam Esmail",
      "written_by": "Adam Penn",
      "air_date": "2017-11-22",
      "us_milions_viewers": 0.54,
      "plot": "Elliot corre hacia Krista y Mr. Robot le hace darse cuenta de que Elliot puede estar involucrado. Darlene está inquieta por la ilusión de Angela de que los muertos seguirán estando bien y volverán. Irving hace que Mr. Robot se dé cuenta de que toda su revolución solo ocurrió porque la élite lo permitió. Zhang planea trasladar la planta de Washington Township al Congo; Zhang arruinó a Price como castigo por su desobediencia y por no controlar a Angela y la demanda y ahora tiene la intención de seleccionar a su reemplazo. Leon mata al amigo de Mobley y hace que Mobley y Trenton ayuden a enterrar el cuerpo en el desierto. Al regresar a casa, se encuentran con el asistente de Zhang y agentes del Ejército Oscuro. Tyrell hace el papel de cautivo, a pesar de la incredulidad de Dominique. Tyrell identifica a los líderes de fsociety que están planeando otro ataque dentro de las 24 horas como los dos sospechosos que se revelan al público. El agente Santiago revela la muerte de Joanna y amenaza al hijo de Tyrell si Tyrell se sale del plan. El Ejército Oscuro muestra a Mobley y Trenton un código para un ataque al control del tráfico aéreo y los obliga a dispararse en la cabeza. Dominique observa cómo la redada encuentra los dos cuerpos que vinculan a fsociety con Irán. Dominique, atónita, cree que el verdadero cerebro, Whiterose, realmente se saldrá con la suya.",
      "preview": "/episodes/29.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c2ad54b8-485b-4d2c-aa52-9ff3590c826f"
    },
    {
      "no_all": 30,
      "no_season": 8,
      "title": "eps3.7_dont-delete-me.ko",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-11-29",
      "us_milions_viewers": 0.44,
      "plot": "Elliot le dice a Darlene que nada, desde las drogas hasta la terapia o el hecho de ingresar voluntariamente en la cárcel, mantiene a raya a Mr. Robot, diciendo que el mundo que se desmorona a su alrededor es culpa suya. Pone sus asuntos en orden dándole su perro a su vecino, tirando su chaqueta de Mr. Robot a la basura y yendo a las familias de Trenton y Mobley para presentar sus respetos. Elliot compra una cantidad letal de pastillas de morfina y se dirige a Coney Island para suicidarse, pero Mohammad, el hermano menor de Trenton, lo disuade, a quien Elliot se ve obligado a cuidar cuando sus padres lo dejan solo. Después de que Mohammad deja una película a la que Elliot lo lleva y va a una mezquita, Elliot lo confronta, quien admite que desearía estar muerto. Después de dejar a Mohammad en su casa, va al apartamento de Angela y le recuerda un 'juego de los deseos' que solían jugar cuando eran niños, lo que le da a Elliot la voluntad de vivir. Después de llegar a casa, recuperar la chaqueta y reinstalar su computadora, nota un mensaje enviado por Trenton antes de su muerte diciendo que hay una manera de deshacer el hack.",
      "preview": "/episodes/30.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/908cb19b-9cfa-4339-bd3f-3a842c7ab653"
    },
    {
      "no_all": 31,
      "title": "eps3.8_stage3.torrent",
      "directed_by": "Sam Esmail",
      "written_by": ["Kyle Bradstreet", "Courtney Looney"],
      "air_date": "2017-12-06",
      "us_milions_viewers": 0.43,
      "plot": "Mr. Robot va a la casa de Tyrell, donde ambos conocen a Price, quien anuncia que Tyrell será una figura decorativa como el nuevo CTO. Tyrell se da cuenta de que sigue siendo el títere del Ejército Oscuro, pero tienen una debilidad en el FBI. Elliot reaparece, leyendo el mensaje de Mr. Robot sobre la conexión. El correo electrónico de Trenton revela que Romero guardó las claves de cifrado de Five/Nine que podrían revertir todo y ahora están dentro del FBI. Darlene seduce a Dominique, pero la atrapan tratando de obtener su placa. Angela sigue engañada, creyendo en el plan de Whiterose para deshacer todo y ya no confía en Elliot; los hombres recogen a Angela. Darlene le dice la verdad al FBI, y también afirma que sabe que el Ejército Oscuro los posee. Santiago entra en pánico y llama a Irving. A través de Irving y Leon, Elliot se reúne con el asistente de Zhang para una Etapa 3 falsa; su escaneo de su computadora portátil le da acceso al Ejército Oscuro. Whiterose está indignada porque trasladar la planta al Congo llevará un mes. Ella da permiso para que Elliot muera.",
      "preview": "/episodes/31.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/f737bedc-08ba-4b2a-9d6d-be3cba1ac6b7"
    },
    {
      "no_all": 32,
      "title": "shutdown -r",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2017-12-13",
      "us_milions_viewers": 0.45,
      "plot": "Dominique y Darlene, secuestrados por Santiago después de descubrir su condición de agente doble, y Elliot son llevados a un granero abandonado. Santiago y Dominique salen a Irving, donde Santiago es asesinado y Dominique se ve obligado a ser el nuevo topo del FBI. En el interior, el asistente de Whiterose, Grant, se prepara para matar a Elliot y Darlene. Elliot idea un plan para trasladar la planta de Whiterose al Congo antes, lo que Elliot puede intentar. Grant se suicida cuando Whiterose dice que ya no es de ninguna utilidad. Elliot consigue trasladar la planta y la terrible experiencia llega a su fin con todos a salvo. Darlene intenta disculparse con Dominique, pero ella se niega a disculparse por odio. Dominique le da a Elliot acceso al FBI, donde se entera de que Romero no era responsable de las claves de cifrado; en cambio, Mr. Robot los salvó, ya que es lo que Elliot querría. Los dos hacen las paces y prometen acabar con los verdaderos villanos del mundo mientras Elliot revierte el Five/Nine. Mientras tanto, Angela es llevada a la casa de Phillip Price, donde él le revela que él es su verdadero padre y la convence de la naturaleza malvada de Whiterose. En una escena post créditos, Darlene es confrontada por Vera frente al departamento de Elliot.",
      "preview": "/episodes/32.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/0af2f3c7-b53d-4498-a90a-e06527d5a0f2"
    }
  ],
  "season_4": [
    {
      "no_all": 33,
      "title": "401 Unauthorized",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-10-06",
      "us_milions_viewers": 0.44,
      "plot": "La temporada retoma la anterior con la conversación de Angela con Price. Angela exige venganza contra Whiterose, pero Price intenta y no logra disuadirla. Mientras él se aleja, los agentes del Ejército Oscuro aparecen y matan a Angela. Whiterose le da a Elliot hasta fines de diciembre para vivir, enviándole una foto del cuerpo de Angela como advertencia. A mediados de diciembre, Tyrell se ha vuelto hosco y aburrido como el títere del CTO. Dominique se ha mudado con su madre y se vuelve muy paranoica; la nueva amiga de su madre, Janice, es su nueva manejadora del Ejército Oscuro, advirtiéndole que regrese al trabajo para limpiar el desastre de Santiago. Elliot y Mr. Robot trabajan juntos para chantajear a un abogado, Freddy, y pueden obtener información de que Whiterose usa el Banco Nacional de Chipre y John Garcin. Freddy se suicida cuando se da cuenta de que el Ejército Oscuro lo persigue. Darlene ha caído en la adicción por la culpa por la desaparición de Angela (Elliot no puede mostrarle la prueba de su muerte). Elliot investiga a John Garcin, pero es una trampa. Tres hombres se llevan a Elliot y le inyectan algo. Él cree que está a punto de morir. Los hombres lo reaniman y Price se revela.",
      "preview": "/episodes/33.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c686cea1-417f-4403-b07f-292d55ba982d"
    },
    {
      "no_all": 34,
      "title": "402 Payment Required",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2019-10-13",
      "us_milions_viewers": 0.34,
      "plot": "Price lleva a Elliot a su escondite y le cuenta sobre un grupo que financia al Ejército Oscuro conocido como Deus, que Zhang había construido a nivel mundial durante décadas. Price sabe que la ex empleada de E-Corp, Susan Jacobs, tenía vínculos con el Ejército Oscuro antes de su desaparición y le dice a Elliot que consiga el dinero del grupo Deus a través de ella. Elliot recibe una llamada de Darlene diciéndole que su madre ha muerto. Descubren que su madre tenía una caja de seguridad, pero el banco se deshizo de ella antes de su muerte. Darlene admite que está realmente de luto por Angela. Después del funeral, Darlene le confiesa a Elliot que mató a Susan Jacobs y se une a él contra Whiterose. Ella le agradece por cuidar de Vera, que ha regresado. Elliot discute con Mr. Robot, y ambos niegan tener conocimiento del regreso de Vera. En su mente, la madre de Elliot le dice a una versión más joven de sí mismo que espere a 'la otra'. Mientras tanto, Dominique le miente al FBI sobre lo que le pasó a Santiago, solo para que su interrogador sea asesinado en un falso suicidio por Janice. Price le dice a Zhang que renunciará a E-Corp y, por lo tanto, cortará lazos con el Ejército Oscuro, lo que obligará al grupo Deus a reunirse en persona para elegir a su sucesor.",
      "preview": "/episodes/34.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/37654214-bab4-408d-b9a2-a67bf9b456ba"
    },
    {
      "no_all": 35,
      "title": "403 Forbidden",
      "directed_by": "Sam Esmail",
      "written_by": "Courtney Looney",
      "air_date": "2019-10-20",
      "us_milions_viewers": 0.29,
      "plot": "En la víspera de Navidad, Wang Shu le aconseja a Zhang que cancele la reunión del Grupo Deus. En cambio, fija la reunión para el día siguiente. Zhang recuerda que su ex amante Chen se suicidó después de su matrimonio forzado. Zhang decide convertir a Tyrell en director ejecutivo de E-Corp. Elliot se acerca a Krista en la calle, pero ella lo empuja con miedo. Elliot y Darlene discuten sobre el plan. Elliot y Mr. Robot piratean a Olivia Cortez, empleada del Banco de Chipre. Al encontrarla en un bar, Mr. Robot le compra una bebida. Hablan de sus familias antes de que Elliot la bese y ella lo lleve a casa. El informante de Vera que vigila a Elliot entrega una foto de Elliot y Krista a la carnicería desde donde Vera contrabandea drogas. Vera le dispara por no ser confiable. Mientras Olivia duerme, Elliot obtiene una contraseña que necesita y se la envía a Darlene. Olivia se acerca a él y le cuenta sus problemas con las drogas y la autolesión. De camino a Allsafe, Elliot le menciona a Mr. Robot que una camioneta blanca los está siguiendo. Cuando Elliot se dirige a su casa, descubre que Tyrell ha entrado en su apartamento. Antes de que Elliot pueda advertirle que es probable que el Ejército Oscuro esté escuchando, Tyrell revela que será el director ejecutivo de E-Corp y que su puesto les permitirá derrotar al Ejército Oscuro.",
      "preview": "/episodes/35.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/27299846-cf1b-4d26-88cd-586689cad60f"
    },
    {
      "no_all": 36,
      "title": "404 Not Found",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2019-10-27",
      "us_milions_viewers": 0.34,
      "plot": "Tyrell noquea al agente del Ejército Oscuro en la camioneta blanca. En una gasolinera remota, Tyrell y Elliot salen y encuentran que la camioneta y el agente se han ido. Perdidos en un bosque y caminando en un círculo gigante, acuerdan que no pueden empezar de nuevo ni salir. Tyrell quiere darse por vencido cuando Elliot admite que nunca se preocupó por él; sigue adelante por el bien de Darlene y quiere advertirle antes de que el Ejército Oscuro lo mate. Darlene se da cuenta de que el acceso de Olivia no es suficiente y que el banco debe ser pirateado directamente. Al ver que entran al apartamento de Elliot, Darlene teme que Elliot esté muerto. Intenta robar un coche y termina llevando a un voluntario del hospital de niños, Santa. Admite que lo único que le queda es su hermano, a quien todavía ama, a pesar de estar furiosa con él. Dominique tiene una pesadilla en la que una mujer a la que invitó la ahoga en una bañera y se pone una máscara del Ejército Oscuro. Al despertar, Dominique parece recuperar su determinación. Elliot, Tyrell y Mr. Robot descubren que la camioneta ha golpeado a un ciervo; El agente del Ejército Oscuro les dispara antes de suicidarse. Tyrell recibe un disparo en el estómago y le dice a Elliot que termine con él y se encargue de Whiterose. Al caminar hacia el bosque, Tyrell, moribundo, encuentra una luz mientras la pantalla se vuelve blanca.",
      "preview": "/episodes/36.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/86d7adaa-6025-4bba-a1ad-23f8c9e2737d"
    },
    {
      "no_all": 37,
      "title": "405 Method Not Allowed",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-11-03",
      "us_milions_viewers": 0.31,
      "plot": "En la mañana de Navidad, Elliot quema la furgoneta y Darlene lo recoge. Elliot y Darlene, haciéndose pasar por un empleado, entran en Virtual Realty, la empresa que mantiene los servidores del Banco Nacional de Chipre. Elliot instala un hack de firmware que les da 40 minutos para obtener la información que necesitan mientras desactiva temporalmente las cámaras de seguridad. Elliot, que está a punto de ser atrapado, provoca un corte de energía, lo que les ayuda a escapar. El equipo de seguridad llama a la policía cuando se dan cuenta de que han sido infiltrados, pero solo ven a Elliot. Él lidera a la policía en una persecución a pie por Central Park. Darlene puede salir caminando, ahora haciéndose pasar por una asistente del gimnasio, y recoger a Elliot después de que es atropellado por un automóvil y salta una barandilla de protección. Janice envía a Dominique al departamento de policía local para darle al Ejército Oscuro el control sobre la investigación de la furgoneta. Mientras se reúne con su familia, el incidente de Central Park está en las noticias. Janice la envía nuevamente para capturar de inmediato a Darlene y Elliot, vistos en una cámara de tráfico. Elliot le envía un mensaje de texto a Price diciéndole que Tyrell no asistirá a la reunión. Price sigue pistas que le llevan a la ubicación de la reunión del Grupo Deus esa noche y responde que se llevará a cabo con o sin Tyrell. Krista se enfrenta a Vera.",
      "preview": "/episodes/37.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/c1a6c9e2-cc95-41b4-9800-697303b5d00d"
    },
    {
      "no_all": 38,
      "title": "406 Not Acceptable",
      "directed_by": "Sam Esmail",
      "written_by": "Amelia Grey",
      "air_date": "2019-11-10",
      "us_milions_viewers": 0.36,
      "plot": "Vera toma a Krista como rehén y la interroga sobre Elliot. Elliot le trae café a Olivia después de conseguir drogas de Leon en la cafetería, le cuenta sobre el Grupo Deus y le pide ayuda. Cuando ella se niega, él revela que le ha añadido Oxycontin en el café, sabiendo que perderá a su hijo si no se mantiene limpia. Dominique sostiene a Darlene a punta de pistola y llama a Janice, quien le dice que mate a Darlene, ya que solo es necesario su teléfono con la ubicación de Elliot. Dominique deja inconsciente a Darlene y la arroja a una bañera. Elliot intenta obligar a Olivia a llamar a su compañero de trabajo, quien puede darle acceso a la información más clasificada del Banco Nacional de Chipre. Ella va al baño y se corta las muñecas, pero Elliot puede evitar que se desangre. Llama a su compañero de trabajo después de darse cuenta de que el Grupo Deus estaba relacionado con la muerte de su madre. Krista le da a Vera sus archivos sobre Elliot. Darlene recupera la conciencia e intenta razonar con Dominique. Dominique le dice a Darlene que la mate para que su familia se libre de la ira del Ejército Oscuro, pero Janice llega. Darlene revela que borró su teléfono. Krista llama a Elliot y le advierte que Vera viene. Él le dice que se reúna con él en Washington Square, sabiendo que Vera estará allí. Elliot es secuestrado en la calle por los hombres de Vera.",
      "preview": "/episodes/38.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/0496622d-91e8-40de-80ce-b816fbae5ca4"
    },
    {
      "no_all": 39,
      "title": "407 Proxy Authentication Required",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-11-17",
      "us_milions_viewers": 0.36,
      "plot": "Vera le ofrece a Elliot, atado a una silla, un puesto a su lado para tomar el control de Nueva York. Vera lleva a Elliot ante Krista e insiste en conocer a Mr. Robot. Mr. Robot se acerca y se ofrece a ayudar a Vera si deja ir a Krista, pero Vera protesta. Elliot le ofrece a Vera el dinero del hackeo de Chipre. Mientras Vera y sus hombres están distraídos por los detalles del hackeo, Elliot saca el arma de su bolso, pero los hombres de Vera ya la habían descargado. Mr. Robot intenta razonar con Vera, quien amenaza con dispararle a Krista hasta que Elliot admite que la necesita. Vera desata a Krista y la obliga a ella y a Elliot a tener una sesión de terapia improvisada. Elliot cree que Mr. Robot y Krista le están ocultando un secreto e insta a Vera a leer sus archivos. Krista le pregunta a Elliot sobre el día en que saltó por la ventana cuando era niño, revelando que Mr. Robot siempre ha existido, protegiendo a Elliot de su padre. Elliot finalmente recuerda que su padre abusó de él, a pesar de que Mr. Robot manipuló su memoria para hacerle creer que era un buen hombre. Vera intenta consolar a Elliot, revelando su propio pasado con abusos sexuales que involucraron a amigos de su madre. Él le confía su filosofía de que las personas que sufren como ellos se vuelven imparables. Elliot admite que no quiere estar solo y Vera le asegura que no lo está. Krista, acercándose sigilosamente, apuñala fatalmente a Vera por la espalda.",
      "preview": "/episodes/39.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2710a368-cc26-4494-a934-033b2a5bccbd"
    },
    {
      "no_all": 40,
      "title": "408 Request Timeout",
      "directed_by": "Sam Esmail",
      "written_by": "Robbie Pickering",
      "air_date": "2019-11-24",
      "us_milions_viewers": 0.37,
      "plot": "Elliot y Krista escapan de su apartamento antes de que los hombres de Vera regresen y encuentren su cuerpo. Krista se dirige a la estación de policía, pero Elliot sigue a una versión más joven de sí mismo hasta el Museo de Queens. Allí, encuentra la llave de su padre para el dormitorio de su infancia, ahora recordando que la había escondido en una de las paredes como su forma de defenderse. Una hora antes de que el Grupo Deus se reúna, Mr. Robot se disculpa con Elliot por no haberlo protegido; Elliot admite que lo creó para ser el padre que necesitaba. Elliot se derrumba mientras Mr. Robot lo consuela. Janice ata a Darlene y Dominique, ordenándole a Darlene que restaure su teléfono para poder encontrar a Elliot. Janice apuñala a Dominique, diciéndole a Darlene que entregue a Elliot o Dominique morirá. Janice llama a su equipo, amenazando con matar a los miembros de la familia de Dominique. Darlene cede y pide su teléfono. Los hombres de Janice no encuentran a Elliot en el apartamento de Krista. Ella llama a su equipo fuera de la casa de Trudy, pero nadie responde al teléfono. Janice se entera de que Dominique envió a Deegan y a la mafia irlandesa para rescatar a su familia y llevarlos a una casa segura, matando a los agentes del Ejército Oscuro en el proceso. Mientras Janice está distraída, Dominique logra dispararle en la cabeza. Dominique pide refuerzos y le dice a Darlene que encuentre a Elliot.",
      "preview": "/episodes/40.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/2b3e83f0-6967-4be1-8da9-d807b8047dd4"
    },
    {
      "no_all": 41,
      "title": "409 Conflict",
      "directed_by": "Sam Esmail",
      "written_by": "Kyle Bradstreet",
      "air_date": "2019-12-01",
      "us_milions_viewers": 0.36,
      "plot": "En la mente de Elliot, Mr. Robot discute con Magda y Young Elliot sobre revelar todo a pesar de que Elliot aún no se ha despertado, diciendo que Mr. Robot puede mostrarle lo que Elliot ha hecho y Darlene podría ser capaz de despertarlo. Mr. Robot y Darlene se preparan para hackear el Grupo Deus; Price les da información sobre la máquina de Whiterose para que puedan destruirla para Angela. Zhang, sospechando que Price y Elliot están planeando algo, mueve en secreto la ubicación de la reunión del Grupo Deus y se encuentra con Price a solas en la ubicación original, aunque Zhang se alarma cuando Tyrell está ausente. Al descubrir la nueva ubicación de la reunión, Mr. Robot envía a Darlene allí mientras él se queda para obtener la información de Zhang. Mr. Robot llama a Zhang al teléfono de Price. Zhang dice que Angela puede ser traída de vuelta, lo que hace que Elliot reaparezca, pero rechaza la oferta. Darlene publica un video de fsociety exponiendo públicamente al Grupo Deus y su ubicación, tomando sus datos cuando llaman a sus conductores para que los recojan. Elliot hackea una torre de telefonía móvil cercana para obtener los datos de Zhang y el Grupo Deus es asaltado. Price se burla de Zhang, diciendo que todo esto ocurrió porque Angela sigue viviendo con sus seres queridos. Zhang le dispara a Price y ve a Elliot mientras se va. El FBI llega a la residencia de Whiterose y se escuchan disparos fuera de su habitación mientras se maquilla.",
      "preview": "/episodes/41.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/7e305347-300a-42f1-9dc5-74fab6a0b9dd"
    },
    {
      "no_all": 42,
      "title": "410 Gone",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-08",
      "us_milions_viewers": 0.45,
      "plot": "Tras el hackeo del Grupo Deus, la identidad de Zhang como Whiterose se ha hecho pública. Dominique se ha recuperado casi por completo y deja el hospital. Bajo investigación del FBI por sus acciones como agente del Ejército Oscuro, no se le permite ver a su familia. Darlene la convence de huir con ella y Elliot, para esconderse del Ejército Oscuro. En cambio, Elliot se va solo a la planta de Washington Township. Leon transporta a Darlene y Dominique al aeropuerto, dándole consejos a Dominique sobre cómo vivir con una nueva identidad. Darlene transfiere una parte sustancial del dinero del Grupo Deus a todos los que tienen cuentas Ecoin, viéndolo como justicia. Dominique se asusta al ver a Irving en la librería del aeropuerto, promocionando su nueva novela. Él le informa que al Ejército Oscuro ya no le importan ella ni Darlene. Sin esa amenaza, Dominique decide no volar a Budapest con Darlene, ya que tiene un trabajo y una familia que cuidar. En la puerta, Darlene tiene un ataque de pánico por estar sola y huye al baño, extrañando a Dominique, quien se dio la vuelta para subir al avión. Darlene se tranquiliza y se recupera sola, pero pierde el vuelo. Dominique por fin consigue dormir un poco mientras el avión despega para comenzar de nuevo.",
      "preview": "/episodes/42.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/13c7dc86-8b11-4b39-ac7d-0d290c050c7e"
    },
    {
      "no_all": 43,
      "title": "eXit",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-15",
      "us_milions_viewers": 0.44,
      "plot": "Los hombres de Whiterose matan a los agentes del FBI enviados por Zhang, mientras ella proclama que ahora solo existe Whiterose. Elliot encuentra la planta nuclear de Washington Township aparentemente desierta. Activa su truco para destruir la máquina de Whiterose, pero es encontrado por agentes del Ejército Oscuro, quienes lo llevan más allá de los empleados asesinados hasta Whiterose. Discuten sobre la naturaleza de las personas, el odio y el mundo. Whiterose afirma que su máquina creará un mundo mejor. Elliot dice que aquellos que lo aman, incluso cuando se odia a sí mismo, hacen que valga la pena salvar el mundo. Whiterose ya ha activado la máquina, lo que desencadena una crisis. Ella dice que Elliot tiene una opción y se suicida. Elliot juega un juego de aventuras que Whiterose le dejó en una computadora vieja, pensando que puede detener la crisis, pero parece ser demasiado tarde. Él y Mr. Robot expresan su amor mutuo mientras todo se vuelve rojo. En un mundo alternativo, Elliot es optimista y feliz, director ejecutivo de AllSafe, comprometido con Angela y hijo único, uno con una relación amorosa con su padre aún vivo. Zhi Zhang es una mujer querida y rica conocida por su filantropía. Elliot consigue una cuenta importante con F Corp después de decir que siempre apoyará a Tyrell, quien es el director ejecutivo de F Corp. Elliot regresa a casa, sorprendido de ver a Elliot con una sudadera con capucha, a quien no reconoce, sentado frente a su computadora. Pide ayuda, pero le dicen que espere al próximo episodio. A Elliot le dicen que espere al próximo episodio.",
      "preview": "/episodes/43.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/65f7f301-87e0-4355-9643-8657ddb7f085"
    },
    {
      "no_all": 44,
      "title": "whoami",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-22",
      "us_milions_viewers": 0.46,
      "plot": "Elliot se despierta en un terreno abandonado tras la explosión en la planta de Washington Township, que ya no está allí. Descubre que la ciudad es un suburbio próspero, donde viven su madre y su padre, ambos vivos. Descubre que sus padres nunca abusaron de él cuando era niño y que Darlene no existe. Regresa a la ciudad, donde se encuentra con los padres de Angela, Emily y Phillip (este último todavía está en la vida de Angela), y le revelan que Elliot se casará con Angela al día siguiente. Va al apartamento del Elliot alternativo y piratea su computadora, descubriendo una unidad oculta de bocetos de él mismo, Darlene y el resto de fsociety. El Elliot alternativo regresa a casa y encuentra al Elliot original en su iMac (como se muestra al final del episodio anterior). Inicialmente alarmado, el Elliot alternativo explica que los bocetos son de un personaje que creó que llevaría una vida emocionante como hacker justiciero, la misma vida que vive el Elliot original. Se tocan, lo que provoca otro terremoto, que hiere gravemente al Elliot alternativo. El Elliot alternativo recibe una llamada de Angela; al escucharla por primera vez desde su muerte, el Elliot original decide que puede tener la vida que siempre quiso y mata al Elliot alternativo.",
      "preview": "/episodes/44.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/65cfe4fc-bb5d-4d38-93f5-302f7b385477"
    },
    {
      "no_all": 45,
      "title": "Hello Eliot",
      "directed_by": "Sam Esmail",
      "written_by": "Sam Esmail",
      "air_date": "2019-12-22",
      "us_milions_viewers": 0.31,
      "plot": "Elliot esconde el cuerpo del Elliot alternativo en un contenedor de almacenamiento, con la intención de tomar el lugar del Elliot alternativo y casarse con Angela. Una oficial de policía, Dominique, intenta arrestar a Elliot después de descubrir el cuerpo del Elliot alternativo. Elliot escapa a Coney Island, donde descubre que no hubo boda. Mr. Robot le explica a Elliot que el mundo en el que se encuentran no es el mundo paralelo del que habló Whiterose, sino una ilusión creada por Elliot con la intención de mantener atrapado al 'verdadero Elliot'. Desconcertado y confundido, Elliot se despierta en la oficina de Krista. Krista (que es una manifestación de la mente de Elliot en este punto) explica que el Elliot que conocemos desde el comienzo de la serie no es el Elliot real, sino una persona llamada 'The Mastermind' que el Elliot real creó para lidiar con su rabia y enojo hacia el mundo. Sin embargo, esta persona decidió tomar el control y atrapó al Elliot real en el mundo utópico, deshaciéndose de Darlene, quien es la conexión más fuerte del Elliot real con la realidad; Krista explica que Mastermind debe devolver el control al verdadero Elliot, pero él se niega y el mundo se derrumba. Mastermind se despierta en el hospital, donde Darlene revela que Whiterose está muerta, su máquina fue destruida y ella sabía que Mastermind había tomado el control. Al aceptar su identidad, Mastermind regresa a la mente de Elliot con el resto de sus personajes. El verdadero Elliot se despierta en el hospital y es recibido por Darlene.",
      "preview": "/episodes/45.jpg",
      "url": "https://iframe.mediadelivery.net/play/385998/eacc8f97-9dfc-4513-a218-2f120b46db2f"
    }
  ]
}
